"---Beginning of Page---\n\n""title - A Crash Course in Assistive Technology\n""p - Work and other activities can be greatly affected when an individual has a disability. Many people adapt by using assistive technology. Assistive technology is any physical or digital product, device, or system that helps people with disabilities increase their independence or functional abilities. These tools improve the academic and professional experiences of students, staff, and faculty, allowing them to work without barriers.\n""p - In this article, we'll explore several types of assistive technology for digital content and web use. The information below is a starting point, not an exhaustive list, as the effectiveness of these tools varies greatly depending on the individual.\n""h2 - Vision\n""h3 - Magnification\n""p - Screen magnification technology enlarges on-screen content, making it easier to see for users with visual impairments. This technology functions like a digital magnifying glass, following the cursor and zooming in on the desired area.\n""h3 - Color Overlay\n""p - Color-adjusting/screen overlay assistive technology is a software tool that modifies a device's screen colors and contrast to improve visibility and readability for individuals with visual impairments.\n""h3 - Text-to-Speech (TTS)\n""p - Text-to-speech technology, or read-aloud technology, converts written text into spoken words, aiding users in reading comprehension and writing improvement.\n""h3 - Screen Readers\n""p - Screen readers are essential software for individuals with disabilities affecting vision. They use a voice synthesizer to convert all meaningful on-screen content like text, images, links, and buttons into speech. This technology provides users with an audio version of the digital world, allowing them to navigate websites, read documents, and access other digital resources with auditory cues.\n""h2 - Hearing\n""h3 - Closed Captions (CC) and Transcripts\n""p - Closed captions are synchronized text that appears on screen with the corresponding audio. Not only do they display spoken words, but they also include non-speech sounds and other auditory information. Building on this concept, transcriptions are text versions of a complete video or live event. Transcripts provide a full account of the video content. In addition to detailing the audio, they provide visual context, actions, and expressions.\n""h3 - Assistive Listening Devices (ALD)\n""p - Assistive listening devices improve a person's ability to hear by amplifying the sounds they want to hear while reducing background noise. They work by transmitting sound directly to a user's ear through various methods, including the use of radio signals, a thin wire to send a signal, and microphones that boost a speaker's voice. Some devices can also connect wirelessly to a smartphone or other device using Bluetooth technology.\n""h3 - Alerting Devices\n""p - Alerting devices are designed to notify people of sounds in their environment, such as a smoke alarm, a doorbell, or a ringing phone, using visual or vibrating signals. Many personal devices, such as cell phones and smartwatches, also have built-in alerting features.\n""h3 - Communication Technology\n""p - Telecommunication Relay Services (TRS) provide a bridge for individuals with hearing disabilities to make and receive phone calls. These services use either a live interpreter or automated speech-to-text conversion to relay conversations, allowing users to communicate via video or text. Some services use a sign language interpreter to relay messages via a videophone, while others use an app to display a real-time transcript of the conversation.\n""h2 - Speech Communication\n""h3 - Speech Generation\n""p - Speech-generating Devices (SGD) are electronic \"talking devices\" that help users with speech disabilities communicate. These devices generate synthesized or recorded words and phrases when a user selects a button or icon. SGDs are highly adaptable and can be operated in various ways, including touchscreens, eye tracking, or head pointers, allowing them to meet a wide range of user needs.\n""h3 - Electronic Fluency\n""p - Electronic Fluency Devices are tools designed for individuals who stutter or have other fluency challenges. They work by providing auditory feedback that helps a person change how they hear their own voice, which can improve fluency. This technology is often delivered through a variety of methods, such as playing the user’s voice back with a slight delay or changing its pitch in real time.\n""h3 - Voice Amplification\n""p - Voice Amplification Devices help users who have difficulty projecting their voice loudly. These devices consist of a microphone and a speaker, making the user's voice more audible and clearer, which can help reduce speech anxiety. Voice amplifiers are available as small, wearable devices, and many personal devices, such as smartphones, now have built-in amplification features for phone calls.\n""h2 - Learning & Cognition\n""h3 - Information Organization\n""p - Organizational tools assist with processing and structuring information. Technologies such as mind-mapping software provide a visual way to organize complex information into clear, manageable segments. Similarly, note-taking applications offer a variety of features to help individuals capture and organize information in an accessible format.\n""h3 - Writing and Math Support\n""p - These tools help individuals who experience challenges with academic tasks. Writing support software, for example, makes the physical act of writing more manageable by providing features like voice-to-text, grammar and spell correction, and text prediction. Math accessibility software makes equations easier to use by offering features such as text-to-speech for reading equations aloud, interactive interfaces, and step-by-step guidance.\n""h3 - Memory and Task Management\n""p - Memory and productivity aids help individuals with cognitive challenges and memory issues with essential everyday tasks. Memory assistance technology, for example, aids with retaining and recalling information, which can reduce anxiety related to forgetfulness. Similarly, productivity and time-tracking apps use reminders, scheduling tools, and visual aids to help users prioritize and manage their tasks effectively.\n""h2 - Mobility\n""h3 - Alternative Input Devices\n""p - Alternative input devices allow individuals with mobility disabilities to interact with digital devices using non-traditional methods. By replacing the standard keyboard and mouse, these tools provide users with greater freedom and independence. Examples include eye-tracking systems, switch devices, and adaptive keyboards.\n""h3 - Voice Recognition\n""p - Voice recognition technology, also known as dictation, empowers individuals by converting spoken words into text and commands. This assistive tool facilitates hands-free interaction with devices, allowing users to not only write emails or create documents but also to navigate digital content and the web by voice. The software's accuracy often improves over time as it recognizes a person's unique speech patterns.\n""h2 - Conclusion\n""p - In an increasingly digital world, assistive technology serves as a vital bridge, removing the barriers that can prevent full participation. Tools for adapting digital and web content are constantly evolving, providing innovative solutions for a wide range of challenges. The continued development and adoption of these technologies are key to ensuring that everyone has the opportunity to succeed and thrive in the digital world.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Accessibility Topics Blog\n""h2 - Popular Articles\n""h2 - Articles Catalog\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - ARIA\n""h2 - Understand\n""p - Learn more about the content format and common accessibility issues before working with ARIA.\n""p - Accessible Rich Internet Applications (ARIA) is a set of roles and attributes designed to enhance web accessibility for individuals who use assistive technologies (AT). ARIA enables developers to add semantic meaning and interactivity to HTML when native mechanisms do not exist. ARIA roles, states, and properties provide additional semantic information to assistive technologies. Think of ARIA as the \"voice\" that communicates the purpose and behavior of web elements to screen readers and other AT.\n""p - Never use ARIA to hide accessibility problems or bad code. Use ARIA to enhance and add additional information. Use ARIA to cloak, or hide original semantics, like with a link in a menu or navigation as a menu item using a role or you could hide a visible label with an expanded aria-label. Be careful and mindful about using these methods because the original semantic information is still available. Use ARIA to add context and support, or enhance existing semantics, like with the state of a button as pressed or not using aria-pressed.\n""h3 - Frequently Asked Questions\n""h4 - When should ARIA be used?\n""p - Use ARIA only when necessary to support semantic and native HTML; ARIA is a supplement, not a replacement. Many native HTML elements are inherently accessible and preferred because they are already supported by various input types and assistive technologies. If you are unsure of what ARIA to use, it is better to use no ARIA rather than mislead with incorrect ARIA.\n""p - According to WebAim's survey of over one million home pages, “The more ARIA attributes that were present, the more detected accessibility errors could be expected.”\n""h4 - What are the benefits of ARIA\n""h4 - What are the limitations of ARIA?\n""p - Assigning a role is a commitment that element functions as described. Breaking this promise (e.g., assigning the role of button to a static image) misleads users and creates digital accessibility barriers rather than improving accessibility. Keeping the promise provided in a role maintains a consistent and accessible digital experience.\n""h2 - Create\n""p - Learn more about ARIA creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - ARIA enhances usability by improving the user experience for those who rely on assistive technologies.\n""h4 - Real Text\n""p - ARIA is not a replacement for real text, but it is used to provide accessible names and descriptions for elements that may not have them.\n""h4 - Structure\n""p - ARIA is essential for defining the structure and purpose of a website when semantic HTML is not used or is insufficient.\n""h4 - Sensory Characteristics\n""p - ARIA helps convey sensory characteristics that are not visually or audibly obvious.\n""h4 - Visual Content\n""p - ARIA is not used to describe visual content directly, but rather to provide a textual alternative to it.\n""h3 - Best Practices\n""h4 - Accordions\n""p - Accordions are commonly used to reduce the need to scroll when presenting multiple sections of content on a single page. Add aria-expanded to indicate whether the section is open or closed. Add aria-controls to connect the content panel to the header.\n""h4 - Carousels\n""p - A carousel presents a set of items, referred to as slides, by sequentially displaying a subset of one or more slides. Typically, one slide is displayed at a time. Then user controls or automated rotations moves to the next or previous slide, hiding the current slide. Add aria-live to announce changes in the content. Use aria-label to describe each slide. Use aria-roledescription to provide a description of the functionality.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that has already been created to evaluate its accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Is ARIA used only when necessary and where native HTML is insufficient?\n""p - Are correct ARIA landmarks used to complement HTML structure?\n""p - Is ARIA used to assist with communicating dynamic content?\n""p - Is ARIA use reviewed for correct use?\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Remediation\n""p - After evaluating your content, you may find several accessibility issues. Prioritize remediating content that has the greatest impact on the user.\n""p - Once you've decided on the most critical accessibility issues to address, it's time to implement changes. This may involve:\n""p - Semantic Structure: Use ARIA roles to define the purpose of a page's regions.\n""p - Dynamic State: Use ARIA states and properties to tell screen readers about the status of interactive elements that change.\n""p - Labels: Use area labels to provide a clear name for elements that don't have visible text.\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Audio-Only\n""h2 - Understand\n""p - Learn more about the content format and common accessibility issues before working with audio-only content.\n""p - Audio can cover a wide range of content, but this page will focus solely on pre-recorded audio-only content. Audio (such as podcasts, audiobooks, voice notes, instructional recordings, etc.) should be usable and understandable by people who are deaf or hard of hearing, as well as those with cognitive, auditory processing, or language barriers. The goal is for everyone, regardless of hearing ability or comprehension needs, to have access to the information conveyed through audio content.\n""p - Audio content falls short when it lacks transcripts, has poor audio quality, unclear speech, lacks contextual information, and the platform is inaccessible. Not everyone processes spoken language equally so backup formats help bridge the gap and give an equal experience to all users.\n""h3 - Frequently Asked Questions\n""h4 - When are audio files most useful?\n""p - Appropriate use cases include storytelling and narrative information, short informational briefings, and supplemental or accessible alternative for other content.\n""h4 - What are the benefits of audio files?\n""p - The benefits of using this format include convenience and flexiblity for consuming content in many ways and locations. Cost-effective and less resource intensive than producing video content.\n""h4 - What are the limitations on audio files?\n""p - Some limitations include exclusion of some audiences, especially hard of hearing. Contextual understanding of concepts or nuanced information.\n""h3 - Recommended Software\n""p - Note: Since the user doesn't need to open the audio file with the same software it was created with, the actual software used for creation isn't as important as the media player. If the audio content follows good creation practices it should be accessible to the user.\n""h4 - Audacity\n""p - Audacity is an easy-to-use, multi-track audio editor and recorder for Windows, macOS, GNU/Linux and other operating systems. Audacity is free, open source software.\n""h4 - GarageBand\n""p - GarageBand is a fully equipped music creation studio right inside your Mac… With an intuitive, modern design, it’s easy to learn, play, record, create, and share your hits worldwide.\n""h2 - Create\n""p - Learn more about audio-only creation principles. Applying the Aspects will address the most common accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in digital accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Choose a media player that can be accessed using various input types (i.e. keyboard navigation). There is a list of recommended media players in the Understand section of this page.\n""p - The content should be presented with accessibility in mind. If the speaker has any visuals, they should describe them to the audience. It is helpful to write a script beforehand so that nothing is left out.\n""h4 - Real Text\n""h4 - Structure\n""p - Use the transcript to create the audio content when possible (an exception being a conversational podcast). This helps keep the content organized and easy to understand.\n""p - Chapter markers can be added to section out the audio and aid with understanding. If sections are added, include them in the transcript as well.\n""p - Any links in the transcript should be read in the audio. This ensures that those who are unable to read the transcript will still get the same information.\n""h4 - Sensory Characteristics\n""p - Media player controls should have proper contrast in all states (started, paused, etc.) The controls should still be visible if the page is magnified or the device orientation has changed.\n""p - If the audio auto-plays, the user should be able to pause it within 5 seconds.\n""h4 - Visual Content\n""p - The media player controls should be sufficiently large and easy to click. They should also have proper labels so the computer can read them out if necessary. It is possible to test this using a screen reader or by looking at the code (for websites).\n""h3 - Best Practices\n""h4 - Content\n""p - The language should be clear and concise. All jargon should be defined and explained, this includes any technical terms and acronyms. The speaker should be as clear as possible, avoiding filler words and sounds as much as possible.\n""h4 - Audio Quality\n""p - The audio must be clear and easy to understand, without static or distortion. The volume and speech rate will be consistent and balanced. The overlap of speakers should be minimized as much as possible. The audio should be optimized for mono playback.\n""h4 - Technical\n""p - The downloadable audio file should have clear metadata.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Review the Transcript - Spot check the audio transcript for completeness and accessibility. The transcript should be a complete clean verbatim version of the audio.\n""p - Ensure High Quality Audio - Avoid static, quality, background noise, and unclear speech as much as possible. If an audio track quality is bad enough, consider rerecording it or finding another alternative.\n""p - Check Player Controls - Use the Tab key to move through the player controls. Use the Enter or Spacebar to try activating them. Ensure they can all be controlled using just keyboard keys.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - What to Choose\n""p - It can be difficult to encounter fully accessible audio files. Ideally, find files with a transcript/text alternative so that users will still be able to receive the content in another format. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Accessible file formats, such as MP3 and WAV\n""p - Audio with companion transcripts/descriptions\n""p - Closed Captions\n""p - For more help, request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Captioning\n""h2 - Introduction\n""p - An important element of video accessibility is captioning. If you are creating content, make sure you plan time to add captions that accurately reflect your content. If you are using someone else's content, take a moment to check if there are quality captions. The accessibility goal of captioning is that someone who only listens to the audio track and someone who only reads the captions are engaging in the same experience.\n""p - Captions are not the same as subtitles. Subtitles provide a transcription of the dialogue in a video in either the same or different language as the audio. Captions are a direct clean verbatim transcription of the entire audio track in the audio language. The goal is not to provide clarity but to provide an equivalent experience in text form.\n""p - Closed captions may be turned on or off by the user and are available to assistive technology. Open captions are burned into the video. We recommend using closed captions whenever possible.\n""h3 - Quality Caption Components\n""p - These five components should be used to check if previously captioned content needs different or more accurate captions. If the video captions satisfy all five questions, we determine it is good enough, unless user feedback says otherwise.\n""p - Have the captions been edited for accuracy?\n""p - Captions should be a minimum of 98% accurate to the clean verbatim spoken content. Unedited auto-generated captions do not meet internal accessibility requirements.\n""p - Are different speakers identified?\n""p - If the speaker name is not important (e.g., narrator, voiceover, single speaker), speaker identification can be omitted. If there are only two speakers, simple identification of speaker change (>>, --, etc.) qualifies. Other speakers, on or off screen, should be identified by title and/or last name. If last name is unknown, first name may be used in lieu of last. If no name is known, another appropriate identifier may be used.\n""p - Are captions timed and broken up correctly?\n""p - Captions should be timed to match the content. Captions should remain on screen with adequate time for the user to read. Captions should be in consistent lines and rows.\n""p - Are important sounds identified?\n""p - Sounds (on and off screen) relevant or responsive to spoken content should be in captions, identified in brackets. Long silences should be noted as well. Important tone or emotional speaking modifiers should be identified.\n""p - Is punctuation and capitalization included to accurately portray meaning and clarity?\n""p - Correct punctuation and capitalization can help provide structure and clarity to captions. Intentional punctuation can help portray meaning; this is especially important with pauses, interruptions, or fade outs.\n""h2 - General Guidelines\n""p - Creating high-quality captions involves more than just a verbatim transcription of audio content. At a high-level, captions have three different pieces that we want to be aware of: formatting (presentation) of content, speech, and non-speech information.\n""h3 - Formatting\n""p - We want our captions to be consistently formatted so they are predictable. This means include only one sentence per caption box, with no more than 2 lines. Each line should be no longer than 35 characters, for a maximum of 70 characters per box. If two lines are used in one box, both lines should be split as evenly as possible where a sentence normally pauses (clauses, phrases, etc.).\n""p - As a general rule, caption boxes should be on the screen for a minimum of 1 second, and a maximum of 6-7 seconds.\n""p - Each speaker should be identified using their last name in all capital letters, followed by a colon, placed before their captioned speech. Speakers should be identified every time the speaker changes.\n""h3 - Speech\n""p - When making captions, speech information takes priority. Caption content as clean verbatim, which means that minor grammatical errors may be removed if it will substantially improve the experience and excess filles can be omitted. Any slang, jargon, or special dialects should be captioned as they are.\n""p - Don't censor or modify swearing or explicit language unless it is censored in the audio track.\n""p - If a speaker says something that can't be easily identified, write [inaudible] or [indistinct] (enclosed in square brackets) to take place of the speech in question.\n""h3 - Non-speech Information\n""p - For content that isn't speech (such as a sound, silence, or music that isn't integral to the understanding of the content), use the following hierarchy to determine whether it should be included in the captions:\n""p - Essential: Crucial to understanding meaning of development; these should always be added.\n""p - Accessory: Helpful but not essential (tone, mood, periphery sounds); these can be added when time and space permit.\n""p - Minimal: Incidental and information-limited; not needed, these should be added only if no other information takes priority.\n""p - Continuous sounds (silence, sounds, or background music that lasts more than 10 seconds) should be on the screen for a minimum of 5 seconds, and a maximum of 10 seconds. If the sound is still playing 30 seconds after, include another indicator that the sound is still playing.\n""p - Identify the source of the sound if not visually apparent.\n""h2 - Specific Guidelines\n""p - Captioning Style Guide | Digital Accessibility Hub\n""p - Captioning Key (dcmp.org)\n""p - Closed Captioning Standards and Protocol for Canadian English Language Television Programming Services [PDF]\n""p - BBC Subtitle Guidelines\n""p - Captions/Subtitles | Web Accessibility Initiative (WAI) | W3C\n""h2 - Video Services\n""h3 - Kaltura\n""p - BYU-Idaho's primary video tool is Kaltura. Kaltura can be accessed through MyMedia in I-Learn or video.byui.edu.\n""p - Adding Content: Adding Content to My Media • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""p - Captioning Content: Editing Captions | Kaltura Knowledge Center\n""p - Import YouTube Videos to Kaltura: Add YouTube Videos to Kaltura | Kaltura Knowledge Center\n""h3 - Microsoft Stream\n""p - Microsoft Stream is an alternative video hosting service that allows you to upload and manage video files. It also features its own caption generator.\n""p - We recommend using Microsoft Stream to generate captions if Kaltura auto-captions are not high-quality due to quiet or distorted sound.\n""p - Editing Captions: View, edit, and manage video transcripts and captions - Microsoft Support\n""h3 - YouTube\n""p - If you have created your video from a script, we recommend using that script with YouTube to create captions. YouTube has the ability to auto-sync text to the video, provided the language is supported. This is recommended for videos with clear audio and less than an hour in length.\n""p - After those captions are created, you can edit them directly in YouTube or download and upload to Kaltura or another preferred platform for further editing and publication.\n""p - Adding Subtitles & Captions: Add subtitles & captions - YouTube Help\n""p - Editing & Removing Captions: Edit or remove captions - YouTube Help\n""h3 - Captions\n""p - Are captions provided for all informational elements (speech and sounds) synchronized to the soundtrack?\n""p - Do the captions meet internal standards (BYU-Idaho Captioning Style Guide) or, at a minimum, quality components?\n""p - Can users customize the appearance of the video captions (closed captions, preferred)?\n""h2 - Captioning Style Guide\n""h2 - Formatting\n""h3 - Division\n""p - Captions are broken into boxes (what appears on screen at one time) and boxes are broken into lines. There should be one sentence per box with no more than 70 total characters (35 characters per line) in 1–2 lines, split as evenly as possible. Avoid wildly differing line lengths in a box.\n""p - !!Short, related sentences containing one or two words by a single speaker can be in a single box, on different lines.\n""h3 - Duration\n""p - Caption boxes should appear on screen for the length of the time that matches the audio for the contents. Caption boxes should also remain on screen long enough for users to read the contents.\n""p - !!Music and continuing sounds or silence may be on screen for up to 10 seconds.\n""h3 - Speaker Identification\n""p - Each speaker should be identified using a unique identifier in all capital letters followed by a colon. Speakers should be identified every time the speaker changes. Default identification is the speaker’s last name.\n""h3 - Other on-screen elements\n""p - When possible, captions should not interfere with or cover important on-screen elements, such as open captions, translations, or visuals. This may mean adjusting line lengths, duration, or having one line per box.\n""h2 - Speech Information\n""h3 - Verbatim\n""p - Captions should represent the entirety of the audio track at a minimum of 98% verbatim accuracy. Minor grammatical errors, deletions, repeats, and fillers may be corrected if it will substantially improve the user experience.\n""p - !!Do not modify or censor swearing or other explicit language unless censored in the audio track.\n""p - !!If there are questions about how to caption, caption verbatim.\n""h3 - Unintelligible or Unclear Speech\n""p - If a speaker says something entirely inaudible or otherwise unintelligible, write inaudible (too quiet) or indistinct (not understandable) enclosed in square brackets to take place of the speech in question.\n""h3 - Foreign Language\n""p - Captions should include audio transcription of the entire audio track in the language of the audio track.\n""p - !!If there is no expectation the user should be able to understand the foreign language, a descriptor may be used.\n""h2 - Punctuation\n""h3 - General\n""p - Follow our internal style guide and Chicago style guide whenever possible, unless it will impede clarity. It is acceptable to start sentences with conjunctions to break up run on sentences.\n""p - !!Avoid using colons outside of scripture references, time, and speaker identification.\n""p - !!Avoid semi-colons except when used as a super-comma in a list.\n""h3 - Breaks in Speech\n""p - Use a suspension (...) to indicate speech that trails off or if a speaker starts a new train of thought.\n""p - Use a double hyphen (--) for jarring breaks, speaker corrections, or external interruptions.\n""p - !!If there is a silence in the middle of a sentence, and the silence is more than 10 seconds, add a descriptor for the silence.\n""h3 - Dashes and Hyphens\n""p - Use a single hyphen for an en dash. Use two consecutive hyphens for an em dash.\n""h2 - Style\n""h3 - Numbers\n""p - All single-digit numbers, including zero, should be spelled out. All other numbers should be expressed with numerals. Use commas in numbers with four or more digits.\n""p - !!Always use numerals with an en dash (no spaces) for a range.\n""h3 - Mathematics\n""p - Always use numerals for math equations, decimals, descriptions, or formulas, except for zero.\n""h3 - Symbols\n""p - Write out names for symbols and variables, except for percentages not beginning a sentence.\n""h3 - Dates and Times\n""p - Follow the formatting of the speaker. Always use numerals in dates and times.\n""p - If the day comes before the month, do not include a comma. If the month comes before the day, add a comma before the year. Never include an ordinal form (‑th, ‑rd, ‑st, etc.), unless the day is referenced without a month or year.\n""h3 - Special Topics\n""p - Be consistent throughout video for specialized subjects and topics, such as coding, chemistry, etc.\n""h3 - Computers\n""p - If referencing a keyboard key, use a capital letter, numeral, or symbol.\n""p - If referencing key combinations, use a +, no spaces, and spell out symbols.\n""p - If referencing menu selections, separate selections with comma. Match capitalization and spelling for on screen and menu elements.\n""p - !!Type URLs and web addresses as normal, including punctuation.\n""h3 - Measurements\n""p - Do not abbreviate units of measurement (for example centimeters, newtons, feet, etc.).\n""h3 - Money\n""p - If the speaker directly references money (dollars, bucks, etc.), use the dollar symbol ($) with numerals. Write out verbatim if it is a single-digit number. Use the dollar symbol with a decimal number for all references to cents.\n""p - !!If the speaker does not specifically reference money (by saying dollars, bucks, etc.), omit the reference ($) in the captions.\n""h3 - Scripture References\n""p - Write all scripture references as if they were parenthetical citations using a colon to separate chapter and verse (e.g., 1 Nephi 3:7).\n""h3 - Quotes\n""p - Enclose all quoted text in quotation marks no matter who the quote is from. If speech is given as if it is an exact quote, enclose it in quotation marks.\n""p - !!If a speaker uses a formal lead-in or close to a quote (start quote, end quote, etc.), designate with only quotation marks, not verbatim text.\n""p - !!Reading on screen text or from a screen does not make speech a quote.\n""h3 - Words and Letters\n""p - Capitalize all single letters used in reference on their own; pluralize letters using ‘s.\n""p - Words used for the word should be enclosed in quotation marks to indicate that the word itself is used not its meaning.\n""p - When spelling, separate capital letters with dashes and no spaces.\n""h3 - Music\n""p - In captioning, music is defined as anything sung or played in a rhythmic and melodic manner. Identify music with a double music note (♪♪) to start and end. Start and end music and lyrics the same way; start and end each caption box in the middle with a single music note (♪).\n""p - Note: To type a musical note, you can hold down Alt and type 13 on your numpad.\n""p - !!Lyrics that are spoken should be styled as quoted text.\n""h2 - Non-Speech Sounds\n""h3 - General\n""p - Non-speech information relevant to the audience should be indicated in all lowercase text enclosed in square brackets. Non-speech information is relevant if it provides information to the audience, interrupts the speaker, or if a speaker references the sound.\n""p - All relevant non-speech information (sounds) should occupy a box by itself unless the speaker made the sound.\n""h3 - Hierarchy of Relevancy\n""p - If there is a conflict between the non-speech information, use the following hierarchy to determine what information to include:\n""p - Essential\n""p - Crucial to understanding meaning or development. Always include this information.\n""p - Accessory\n""p - Helpful, but not essential. Include when possible.\n""p - Minimal\n""p - Incidental and information-limited. Include only when time and space allow.\n""h3 - Source\n""p - Identify the source of a sound if it is not clearly seen on screen.\n""p - !!The source does not need to be repeated if the sound continues.\n""h3 - Verb Tense\n""p - Sounds made by the speaker, or external abrupt sounds, should use the third person present tense (‑s). Sustained sounds external to the speaker should use the present participle form (‑ing).\n""h3 - Tone Modification\n""p - A speaker with a notable accent should be described as having such, particularly if it plays a role in their grammar or ease of understanding.\n""p - !!Retain dialect and colloquial words and phrases used by speakers with accents.\n""p - If a speaker modifies tone in a significant way, indicate it with a descriptor. Speech modification descriptors should be adverbs or participles.\n""h2 - Full Style Guide (including examples)\n""p - Brigham Young University-Idaho Captioning Style Guide - version 2 (expanded)\n""h2 - Uploading a Video\n""p - Adding Content to My Media • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""h2 - Help us Find Your Video (Metadata)\n""p - Accessibility Services can help support your efforts to provide captioned videos. To help us make sure we can find your videos when needed, please help us by completing the metadata fields for your uploaded videos.\n""h3 - Tags\n""p - Add a tag to the video that includes your course code and number (ex. MATH 304)\n""p - Add a tag to the video that includes the week number the video is used in your course (ex. W02)\n""p - If the video is not for a course, add a tag with the location, office, or event.\n""h3 - Hearing Impaired\n""p - Choose “Yes” if you have received a captioning accommodation request\n""p - Choose “No” for all other reasons\n""h3 - Video Purpose\n""p - One or Two Semesters: select this option if your video is only for a limited time. Examples include things like office hours, Zoom meetings, or other videos you do not plan to use again.\n""p - Long running course: select this option if you will be using the content for longer than two semesters.\n""p - Master Course for Online Learning: select this option if the video appears is a master course (campus or online) that will be used in multiple sections for the foreseeable future.\n""p - Campus wide broadcast/communication/website: select this option if the video will be posted publicly on a BYU-Idaho website, social media, YouTube, or other platform. Anything that has a publishing status of public will use this option unless in a course.\n""p - None of the above: select this option if none of the others fit your video use. This option should also be used by students submitting videos for assignments.\n""h3 - Publishing Status\n""p - Unlisted will make the video available only through the link; it will not be available through a search on video.byui.edu. This is the recommended publishing status for most course videos.\n""p - You may need to access My Media through video.byui.edu to use the Unlisted status.\n""p - Published will be used for videos made public on video.byui.edu. These can be found through the search feature.\n""p - Private videos are only viewable by you or co-editors/owners/publishers. Other users will not be able to view, even if they have a link.\n""h2 - Adding Videos to Canvas\n""p - Share Video: Embed Media in Canvas • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""h2 - Finding the Kaltura ID\n""p - Accessibility Services wants to help support you in your efforts to provide accessible content. In order to help you with your specific video, Accessibility Services may ask for the Kaltura ID. You can find this ID in several places. The Kaltura ID is a number or letter followed by an underscore and eight more numbers and letters (example: 1_3wsu3c5t)\n""p - If you open the video in video.byui.edu, the Kaltura ID will be at the end of the URL in your address bar.\n""p - If you open the video in edit mode from My Media, the Kaltura ID will be in the Basic Info panel as Media Entry ID.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Captioning\n""p - An important element of video accessibility is captioning. If you are creating content, make sure you plan time to add captions that accurately reflect your content. If you are using someone else's content, take a moment to check if there are quality captions. The accessibility goal of captioning is that someone who only listens to the audio track and someone who only reads the captions are engaging in the same experience.\n""p - Captions are not the same as subtitles. Subtitles provide a transcription of the dialogue in a video in either the same or different language as the audio. Captions are a direct clean verbatim transcription of the entire audio track in the audio language. The goal is not to provide clarity but to provide an equivalent experience in text form. Closed captions may be turned on or off by the user and are available to assistive technology. Open captions are burned into the video. We recommend using closed captions whenever possible.\n""h2 - Quality Caption Components\n""p - These five components should be used to check if previously captioned content needs different or more accurate captions. If the video captions satisfy all five questions, we determine it is good enough, unless user feedback says otherwise.\n""p - Have the captions been edited for accuracy? - Captions should be a minimum of 98% accurate to the clean verbatim spoken content. Unedited auto-generated captions do not meet internal accessibility requirements.\n""p - Are different speakers identified? - If the speaker name is not important (e.g., narrator, voiceover, single speaker), speaker identification can be omitted. If there are only two speakers, simple identification of a speaker change (>>, --, etc.) qualifies. Other speakers, on or off screen, should be identified by title and/or last name. If last name is unknown, first name may be used in lieu of last. If no name is known, another appropriate identifier may be used.\n""p - Are captions timed and broken up correctly? - Captions should be timed to match the content. Captions should remain on screen with adequate time for the user to read. Captions should be in consistent lines and rows.\n""p - Are important sounds identified? - Sounds (on and off screen) relevant or responsive to spoken content should be in captions, identified in brackets. Long silences should be noted as well. Important tone or emotional speaking modifiers should be identified.\n""p - Are punctuation and capitalization included to accurately portray meaning and clarity? - Correct punctuation and capitalization can help provide structure and clarity to captions. Intentional punctuation can help portray meaning; this is especially important with pauses, interruptions, or fade outs.\n""h2 - General Guidelines\n""p - Creating high-quality captions involves more than just a verbatim transcription of audio content. At a high-level, captions have three different pieces that we want to be aware of: formatting (presentation) of content, speech, and non-speech information.\n""h3 - Formatting\n""p - We want our captions to be consistently formatted so they are predictable. This means include only one sentence per caption box, with no more than 2 lines. Each line should be no longer than 35 characters, for a maximum of 70 characters per box. If two lines are used in one box, both lines should be split as evenly as possible where a sentence normally pauses (clauses, phrases, etc.). As a general rule, caption boxes should be on the screen for a minimum of 1 second, and a maximum of 6-7 seconds.\n""p - Each speaker should be identified using their last name in all capital letters, followed by a colon, placed before their captioned speech. Speakers should be identified every time the speaker changes.\n""h3 - Speech\n""p - When making captions, speech information takes priority. Caption content as clean verbatim, which means that minor grammatical errors may be removed if it will substantially improve the experience and excess filles can be omitted. Any slang, jargon, or special dialects should be captioned as they are. Don't censor or modify swearing or explicit language unless it is censored in the audio track.\n""p - If a speaker says something that can't be easily identified, write [inaudible] or [indistinct] (enclosed in square brackets) to take place of the speech in question.\n""h3 - Non-speech Information\n""p - For content that isn't speech (such as a sound, silence, or music that isn't integral to the understanding of the content), use the following hierarchy to determine whether it should be included in the captions:\n""p - Essential: Crucial to understanding meaning of development; these should always be added.\n""p - Accessory: Helpful but not essential (tone, mood, periphery sounds); these can be added when time and space permit.\n""p - Minimal: Incidental and information-limited; not needed, these should be added only if no other information takes priority.\n""p - Continuous sounds (silence, sounds, or background music that lasts more than 10 seconds) should be on the screen for a minimum of 5 seconds, and a maximum of 10 seconds. If the sound is still playing 30 seconds after, include another indicator that the sound is still playing. Identify the source of the sound if not visually apparent.\n""h2 - Specific Guidelines\n""p - Captioning Style Guide | Digital Accessibility Hub\n""p - Captioning Key (dcmp.org)\n""p - Closed Captioning Standards and Protocol for Canadian English Language Television Programming Services [PDF]\n""p - BBC Subtitle Guidelines\n""p - Captions/Subtitles | Web Accessibility Initiative (WAI) | W3C\n""h2 - Video Services\n""h3 - Kaltura\n""p - BYU-Idaho's primary video tool is Kaltura. Kaltura can be accessed through MyMedia in I-Learn or video.byui.edu.\n""p - Adding Content: Adding Content to My Media • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""p - Captioning Content: Editing Captions | Kaltura Knowledge Center\n""p - Import YouTube Videos to Kaltura: Add YouTube Videos to Kaltura | Kaltura Knowledge Center\n""h3 - Microsoft Stream\n""p - Microsoft Stream is an alternative video hosting service that allows you to upload and manage video files. It also features its own caption generator.\n""p - We recommend using Microsoft Stream to generate captions if Kaltura auto-captions are not high-quality due to quiet or distorted sound.\n""p - Editing Captions: View, edit, and manage video transcripts and captions - Microsoft Support\n""h3 - YouTube\n""p - If you have created your video from a script, we recommend using that script with YouTube to create captions. YouTube has the ability to auto-sync text to the video, provided the language is supported. This is recommended for videos with clear audio and less than an hour in length.\n""p - After those captions are created, you can edit them directly in YouTube or download and upload to Kaltura or another preferred platform for further editing and publication.\n""p - Adding Subtitles & Captions: Add subtitles & captions - YouTube Help\n""p - Editing & Removing Captions: Edit or remove captions - YouTube Help\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Captioning Style Guide\n""h2 - Formatting\n""h3 - Division\n""p - Captions are broken into boxes (what appears on screen at one time), and boxes are broken into lines. There should be one sentence per box with no more than 70 total characters (35 characters per line) in 1–2 lines, split as evenly as possible. Avoid wildly differing line lengths in a box.\n""p - !! Short, related sentences containing one or two words by a single speaker can be in a single box, on different lines.\n""h3 - Duration\n""p - Caption boxes should appear on screen for the length of the time that matches the audio for the contents. Caption boxes should also remain on screen long enough for users to read the contents.\n""p - !! Music and continuing sounds or silence may be on screen for up to 10 seconds.\n""h3 - Speaker Identification\n""p - Each speaker should be identified using a unique identifier in all capital letters followed by a colon. Speakers should be identified every time the speaker changes. Default identification is the speaker’s last name.\n""h3 - Other On-screen Elements\n""p - When possible, captions should not interfere with or cover important on-screen elements, such as open captions, translations, or visuals. This may mean adjusting line lengths, duration, or having one line per box.\n""h2 - Speech Information\n""h3 - Verbatim\n""p - Captions should represent the entirety of the audio track at a minimum of 98% verbatim accuracy. Minor grammatical errors, deletions, repeats, and fillers may be corrected if it will substantially improve the user experience.\n""p - !! Do not modify or censor swearing or other explicit language unless censored in the audio track.\n""p - !! If there are questions about how to caption, caption verbatim.\n""h3 - Unintelligible or Unclear Speech\n""p - If a speaker says something entirely inaudible or otherwise unintelligible, write inaudible (too quiet) or indistinct (not understandable) enclosed in square brackets to take place of the speech in question.\n""h3 - Foreign Language\n""p - Captions should include audio transcription of the entire audio track in the language of the audio track.\n""p - !! If there is no expectation the user should be able to understand the foreign language, a descriptor may be used.\n""h2 - Punctuation\n""h3 - General\n""p - Follow our internal style guide and Chicago style guide whenever possible, unless it will impede clarity. It is acceptable to start sentences with conjunctions to break up run on sentences.\n""p - !! Avoid using colons outside of scripture references, time, and speaker identification.\n""p - !! Avoid semi-colons except when used as a super-comma in a list.\n""h3 - Breaks in Speech\n""p - Use a suspension (...) to indicate speech that trails off or if a speaker starts a new train of thought.\n""p - Use a double hyphen (--) for jarring breaks, speaker corrections, or external interruptions.\n""p - !! If there is a silence in the middle of a sentence, and the silence is more than 10 seconds, add a descriptor for the silence.\n""h3 - Dashes and Hyphens\n""p - Use a single hyphen for an en dash. Use two consecutive hyphens for an em dash.\n""h2 - Style\n""h3 - Numbers\n""p - All single-digit numbers, including zero, should be spelled out. All other numbers should be expressed with numerals. Use commas in numbers with four or more digits.\n""p - !! Always use numerals with an en dash (no spaces) for a range.\n""h3 - Mathematics\n""p - Always use numerals for math equations, decimals, descriptions, or formulas, except for zero.\n""h3 - Symbols\n""p - Write out names for symbols and variables, except for percentages not beginning a sentence.\n""h3 - Dates and Times\n""p - Follow the formatting of the speaker. Always use numerals in dates and times.\n""p - If the day comes before the month, do not include a comma. If the month comes before the day, add a comma before the year. Never include an ordinal form (‑th, ‑rd, ‑st, etc.), unless the day is referenced without a month or year.\n""h3 - Special Topics\n""p - Be consistent throughout video for specialized subjects and topics, such as coding, chemistry, etc.\n""h3 - Computers\n""p - If referencing a keyboard key, use a capital letter, numeral, or symbol.\n""p - If referencing key combinations, use a +, no spaces, and spell out symbols.\n""p - If referencing menu selections, separate selections with comma. Match capitalization and spelling for on screen and menu elements.\n""p - !! Type URLs and web addresses as normal, including punctuation.\n""h3 - Measurements\n""p - Do not abbreviate units of measurement (for example centimeters, newtons, feet, etc.).\n""h3 - Money\n""p - If the speaker directly references money (dollars, bucks, etc.), use the dollar symbol ($) with numerals. Write out verbatim if it is a single-digit number. Use the dollar symbol with a decimal number for all references to cents.\n""p - !! If the speaker does not specifically reference money (by saying dollars, bucks, etc.), omit the reference ($) in the captions.\n""h3 - Scripture References\n""p - Write all scripture references as if they were parenthetical citations using a colon to separate chapter and verse (e.g., 1 Nephi 3:7).\n""h3 - Quotes\n""p - Enclose all quoted text in quotation marks no matter who the quote is from. If speech is given as if it is an exact quote, enclose it in quotation marks.\n""p - !! If a speaker uses a formal lead-in or close to a quote (start quote, end quote, etc.), designate with only quotation marks, not verbatim text.\n""p - !! Reading on screen text or from a screen does not make speech a quote.\n""h3 - Words and Letters\n""p - Capitalize all single letters used in reference on their own; pluralize letters using ‘s.\n""p - Words used for the word should be enclosed in quotation marks to indicate that the word itself is used not its meaning.\n""p - When spelling, separate capital letters with dashes and no spaces.\n""h3 - Music\n""p - In captioning, music is defined as anything sung or played in a rhythmic and melodic manner. Identify music with a double music note (♪♪) to start and end. Start and end music and lyrics the same way; start and end each caption box in the middle with a single music note (♪).\n""p - Note: To type a musical note, you can hold down Alt and type 13 on your numpad.\n""p - !! Lyrics that are spoken should be styled as quoted text.\n""h2 - Non-Speech Sounds\n""h3 - General\n""p - Non-speech information relevant to the audience should be indicated in all lowercase text enclosed in square brackets. Non-speech information is relevant if it provides information to the audience, interrupts the speaker, or if a speaker references the sound.\n""p - All relevant non-speech information (sounds) should occupy a box by itself unless the speaker made the sound.\n""h3 - Hierarchy of Relevancy\n""p - If there is a conflict between the non-speech information, use the following hierarchy to determine what information to include:\n""p - Essential - Crucial to understanding meaning or development. Always include this information.\n""p - Accessory - Helpful, but not essential. Include when possible.\n""p - Minimal - Incidental and information-limited. Include only when time and space allow.\n""h3 - Source\n""p - Identify the source of a sound if it is not clearly seen on screen.\n""p - !! The source does not need to be repeated if the sound continues.\n""h3 - Verb Tense\n""p - Sounds made by the speaker, or external abrupt sounds, should use the third person present tense (‑s). Sustained sounds external to the speaker should use the present participle form (‑ing).\n""h3 - Tone Modification\n""p - A speaker with a notable accent should be described as having such, particularly if it plays a role in their grammar or ease of understanding.\n""p - !! Retain dialect and colloquial words and phrases used by speakers with accents.\n""p - If a speaker modifies tone in a significant way, indicate it with a descriptor. Speech modification descriptors should be adverbs or participles.\n""h2 - Full Style Guide\n""p - Brigham Young University-Idaho Captioning Style Guide - version 2 (expanded)\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Cascading Style Sheets (CSS)\n""h2 - Understand\n""p - Learn more about the content format and common accessibility issues before working with CSS.\n""p - CSS (Cascading Style Sheets) is a stylesheet language used to control the presentation of web content, including layout, colors, fonts, and spacing, to create visually appealing and functional designs. In the context of digital accessibility, CSS helps make content easier to see, navigate, and use for everyone, including people with disabilities. Proper use of CSS can enhance accessibility by supporting responsive design, enabling customization for user preferences, and ensuring visual cues like focus indicators and sufficient contrast. However, CSS must be implemented carefully, as misuse (e.g., relying on fixed layouts or using color alone to convey information) can create barriers for assistive technologies and diverse user needs.\n""p - The content and functionality of a webpage should be fully understandable and usable even if CSS is disabled or not loading. This principle ensures that users relying on screen readers, text-only browsers, or those with limited internet access can still access all critical information.\n""p - CSS provides a mechanism for adding styles such as fonts, colors, spacing to web content. CSS tells technology how to display the information.\n""h3 - Frequently Asked Questions\n""h4 - When should CSS be used?\n""p - To improve the appearance of webpages and help users understand content better.\n""h4 - What are the benefits of CSS?\n""p - CSS is ideal for organizing the visual presentation of content and creating responsive designs.\n""h4 - What are the drawbacks of CSS?\n""p - CSS can override defaults which may cause accessibility issues (i.e. other styling makes the keyboard focus invisible).\n""h2 - Create\n""p - Learn more about creating accessible audio files. The Aspects address the most common accessibility issues. Following these principles will help make more accessible and user-friendly content. Best practices are “nice-to-haves” in accessibility; focus on these after applying the aspects.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Relative Units: Allow users to adjust settings like font size, line height, and color schemes to meet their individual needs. Use relative units like em, rem, and percentages (%) for fonts, text containers, column widths, padding, and margins.\n""h4 - Real Text\n""p - CSS can help text adapt to the viewing method to be easier to read for visually impaired users.\n""h4 - Structure\n""p - Responsive Design: Ensure that your website or application adapts to different screen sizes and orientations to provide an optimal viewing experience for all users. This includes maintaining usability on desktops, tablets, and mobile devices. Use flex and media queries to adjust content and layout dynamically. Avoid fixed-width layouts. Be aware that using grid layouts can cause a keyboard navigation disconnect by making the visual layout and source code order different.\n""h4 - Sensory Characteristics\n""p - Sensory Elements: Avoid relying solely on sensory characteristics like color, shape, or size to convey information. Ensure text and graphical elements meet minimum contrast ratios by adjusting color combinations using color and background-color properties.\n""p - Focus: A visible focus indicator ensures keyboard users can navigate interfaces efficiently. There will automatically be a focus indicator when you add a focusable element to your HTML. Do not remove it! Adjust the styles to better fit your design needs. Make sure it has sufficient contrast against other background colors and the background color of the component receiving focus.\n""h4 - Visual Content\n""p - CSS can be used to make images easier and less distracting to see. It can also make the focus indicator more distinguishable.\n""h3 - Best Practices\n""h4 - Screen Reader Content\n""p - Sometimes, specific content is needed for screen reader users but not for sighted users. This can be achieved with visually hidden styles. This technique is useful for including long descriptions or detailed explanations that complement visible content without distracting users who do not need this information. This ensures that screen readers announce additional context without displaying it visually.\n""h4 - Media Queries\n""p - CSS experts recommend always designing for mobile first! Media queries enable the creation of responsive layouts tailored to different devices and environments. This is a great way to create designs that present well on all kinds of devices because they enlarge, shrink, or wrap content in the available space.\n""h4 - Focus\n""p - Avoid relying solely on sensory characteristics like color, shape, or size to convey information. Ensure text and graphical elements meet minimum contrast ratios by adjusting color combinations using color and background-color properties.\n""h2 - Evaluate\n""p - This reveals content that is inaccessible but won't guarantee complete accessibility. Continue reading for in-depth accessibility checks and practices.\n""h3 - Check Accessibility\n""p - Does CSS use relative units for sizing to aid with responsive design?\n""p - Does CSS provide visible focus indication for all interactive elements?\n""p - Does CSS help the responsive design and practices for custom user settings?\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Remediation\n""p - After evaluating your content, you may find several accessibility issues. Prioritize remediating content that has the greatest impact on the user.\n""p - Once you've decided on the most critical accessibility issues to address, it's time to implement changes. This may involve:\n""p - Color Contrast: Ensure the contrast between text and background colors is high enough to meet WCAG standards, which is crucial for users with low vision.\n""p - Logical Hiding: Use CSS to visually hide content (like a \"skip to main content\" link) from the screen while keeping it available to screen readers.\n""p - Clear Focus Indicators: Provide a clear, visible outline around elements when they receive keyboard focus. This is essential for users who navigate with a keyboard.\n""p - Responsive and Scalable Design: Use relative units like rem and em for sizing to allow text and layouts to scale with user preferences without breaking the design.\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Common Digital Accessibility Terminology\n""h2 - Key Terms\n""p - Digital Accessibility - The practice of ensuring equally effective and equally integrated functionality, interaction with, and access to digital content for all otherwise qualified users with substantially equivalent ease of use.\n""p - Digital Content - Information or data accessed on or shared through a computer or other electronic information technology (EIT), including digital sensory experiences. Examples include documents, emails, web pages, courses, multimedia, and software.\n""p - Electronic Information Technology (EIT) - Equipment or systems that process and communicate information or data in various forms, including the creation, manipulation, storage, transmission, or acquisition.\n""h2 - Other Terms\n""p - Accessible - A person with a disability is afforded the opportunity to acquire the same information, engage in the same interactions, and enjoy the same services as a person without a disability in an equally effective and equally integrated manner, with substantially equivalent ease of use.\n""p - Accommodation - An adaption or adjustment to meet the needs of an individual.\n""p - Assistive Technology - Any item, piece of equipment, software program, or product system that is used to increase, maintain, or improve the functional capabilities of persons with disabilities.\n""p - Audio Description - A narration added to the soundtrack to describe important visual details that cannot be understood from the main soundtrack alone.\n""p - Clean Verbatim - Audio transcription or captions exactly matching the original format with excess fillers omitted and minor grammatical errors removed if it will substantially improve the experience.\n""p - Descriptive Transcript - A direct alternative format of video, not generally used alongside or with a video. The descriptive transcript can be used independently of the video and the user should receive the same information and engage in an equivalent experience as if they watched the video.\n""p - Equally Effective Alternative Access - An alternate format, medium, or other aid that provides equal access to digital content when the original does not and cannot be remediated to provide an accessible experience.\n""p - Parallel - In the context of digital content, structure of items (list items, headings, etc.) should be similar, including: grammar, tense, length, and punctuation.\n""p - Semantic - In this context, a computer can interpret the meaning; or that the meaning is interpretable by technology.\n""p - Universal Design for Learning (UDL) - A flexible teaching approach that provides multiple ways for students to access and engage in the learning process\n""p - Usable - The ability for users to achieve the specified or intended goals effectively, efficiently, and satisfactorily.\n""p - Web Content Accessibility Guidelines (WCAG) - Normative and informative components to guide the design of more accessible web and digital content; developed through the World Wide Web Consortium (W3C) process as part of the Web Accessibility Initiative (WAI).\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Content Formats\n""p - Learn the basics of each content format, steps to create them with accessibility, how to evaluate their accessibility, and decide if the format is the best for a given need or situation.\n""h2 - Content Formats\n""p - Here are some of the most common digital content formats. If you need help with content that isn't listed, reach out to the Accessibility Services Office; they can help walk you through the process and give you more resources.\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Create Digital Content with Accessibility\n""p - This page covers how to build accessibility into different forms of digital content. This includes overarching principles and help creating a plan for your work. This is important for content creators and instructors.\n""h2 - Creating with Accessibility\n""p - Creating with accessibility means building digital content that can be used and understood by as many people as possible, regardless of ability. Across all formats the same basic principles apply. Because the range of tools and platforms is so wide, developing a personal scope is important. By mapping out how you create, share, and collaborate on digital materials, you can identify where digital accessibility practices matter most in your daily work and start applying them consistently from the beginning.\n""h2 - What is Digital Content?\n""p - Digital Content is information or data accessed on or shared through a computer or other electronic information technology (EIT), including digital sensory experiences.\n""p - Here is a list of common digital content:\n""p - Webpages\n""p - Documents (PDF, Word, Excel, PowerPoint, etc.)\n""p - Emails\n""p - Videos and Images\n""p - Courses\n""p - Electronic Books and Databases\n""p - Software\n""p - Audio Files\n""p - We all have a different digital environment depending on our work position and lifestyle. This page will help you define what digital content you use and how to create a digital accessibility plan to prioritize what content needs attention.\n""h2 - Your Digital Environment\n""p - Follow the directions to create a list of all your digital content and determine what the top priorities are. You can use this list to organize what you need to learn first or what trainings will be required.\n""h3 - List Your Digital Environment\n""p - We each have a unique digital environment with content that requires accessibility. The goal of this section is to make a comprehensive list of all the digital content you use, especially content that is shared with multiple people. Based on your role, you may write down different types of digital content. For example, an instructor might write down Canvas (or LMS), emails, documents, videos, and more. A developer might write software, websites, email, etc. Make this list as extensive as possible.\n""p - There is a “Personal Digital Content” document that lays out a system for listing content and prioritizing it. Feel free to download a copy of this document to help create your own scope:\n""p - The following questions will help you identify what content you use regularly. Add any addition platforms or formats to your list.\n""p - How do you document and record your work? - Think about the tools you use to create and save your work, such as Word documents, PDFs, spreadsheets, software services, or notes in shared drives. The formats you choose and the way you structure information determine how easily others can access and use your content.\n""p - How do you share content with others? - Consider the ways you distribute information, often through email, cloud storage, websites, or learning platforms. Each method introduces opportunities to make content either easier or harder to access.\n""p - How do you collaborate on work with others? - Collaboration often happens in shared documents, project management platforms, or version-controlled systems. Digital accessibility matters here too, since headings, meaningful link text, and accessible commenting tools can help all collaborators follow the work.\n""p - What platform do you use to communicate with others? - Communication platforms like email, chat apps, or video conferencing tools form the backbone of how people stay connected. The platform you choose and how you use it affects who can fully participate.\n""p - Are you creating resources others access? - If you create resources such as presentations, training materials, guides, or media for others, you are shaping the experience of your audience. Ensuring those resources are accessible means more people can benefit from your work.\n""h3 - Sort by Priority\n""p - Now that you have a list of all your digital content, it's time to decide where to start. Here are three priority tiers that explain what is most important. After reading through the priority tiers take a moment to mark your priorities on your digital environment list.\n""h4 - Tier #1: High Priority\n""p - High-priority digital content should be made accessible as soon as possible because it directly impacts access to essential information and experiences. This includes materials for students with approved accommodations, course syllabi, newly created digital content, and any front-facing or public content. Making these resources accessible right away ensures equal participation and avoids creating barriers for those who rely on them most.\n""h4 - Tier #2: Normal Priority\n""p - Normal-priority digital content should be made accessible, when possible, especially as part of routine updates and maintenance. Examples include content you revise, materials shared outside of your department, resources presented or displayed within your department, and content that is used regularly. Addressing digital accessibility during these natural update cycles keeps it manageable while steadily improving access across your organization.\n""h4 - Tier #3: Low Priority\n""p - Low-priority digital content should be made accessible when time allows or when the content is actively used. This category often includes materials borrowed from others or provided by third parties, as well as archived resources kept for historical record. While not urgent, reviewing and improving digital accessibility in these cases still strengthens long-term inclusivity and prevents barriers if the content is reintroduced or reused.\n""h4 - Exempt Content\n""p - When content is for personal use only it is exempt from digital accessibility requirements. Examples of this type of content include draft documents, to-do lists, and personal notes. Since personal content won't be shared with anyone, it only needs to fit your accessibility needs. However, it is still a good practice to follow accessibility guidelines and build the habit into everything you create. This also makes the content more user-friendly in general.\n""h3 - Congrats!\n""p - Now you have a comprehensive list of all the digital content you use often and where digital accessibility is a priority!\n""p - Continue to add to this list as new content comes up but take it one step at a time. Looking at the whole list can be overwhelming but remember, not everything needs to be accessible today. Focus on the most important thing and work on that.\n""h2 - Finding Accessibility Issues\n""p - Now that you have your digital content list with your priorities, it's time to start with top priority. There are many ways to go about making content accessible. Remember that the Accessibility Services Office is here to help at any time. Contact us to set up a training or get assistance with a specific piece of content. Here are some options on this website to get you started:\n""p - Visit the Content Formats page to learn more about specific content formats and how to make them accessible:\n""p - Visit the pages on the Aspects of Digital Accessibility to get an overview of common issues across all formats:\n""p - Continue to the Evaluate page to learn how to test content for compromised accessibility. This applies to existing content that needs attention:\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Deciding on Accessible Content\n""p - This page covers choosing third-party content that is accessible. It includes how to review testing results and how to understand the risk involved and how to make a plan when challenges arise. This is important for purchasers and instructors..\n""h2 - Introduction\n""p - As we think with digital accessibility in mind, there are three things that are beneficial to remember when making decisions for accessibility.\n""h3 - Barrier\n""p - A barrier is anything that hinders someone’s ability to use your digital product effectively. By pinpointing the exact barrier, you can prioritize its importance. For instance, missing a keyboard shortcut for a function requires a different fix than unintelligible audio without captions. Many accessibility guidelines, like the Web Content Accessibility Guidelines (WCAG), outline specific criteria for different types of barriers.\n""h3 - Identification\n""p - Identify how the barrier was discovered.  Specifying the source can help prioritize the issue. For instance, user-reported barriers might require a quicker fix than those identified in an ACR. Additionally, if you have further details about how the issue came to light, including them here can provide valuable context. This could be mentioned alongside the potential violation of a specific WCAG success criterion. By capturing these details, you can gain a deeper understanding of the barrier and its potential impact on users.\n""h3 - Affected Party\n""p - The specific needs of the affected party can influence the solution chosen. For example, if the barrier impacts users with visual impairments, solutions like increased color contrast or providing alternative text descriptions become relevant. Try to understand your audience and how content effects those that have visual, auditory, mobility, and cognitive impairments.\n""h2 - Understanding Risk\n""p - When we talk about risks in Digital Accessibility, think to what degree our university community be affected because of the inaccessibility our web content has. When a university does not look at their shortcomings, the consequences lead to loss of money and resources but also damage of reputation, loss of interest from potential students with disabilities, and an interruption in the education received by the students in need. If these issues are addressed when a complaint is received, or better yet, we act preemptively to avoid these situations, the expenses made to accommodate the needs of a student or worker are much more preferrable than the process of litigation and loss of opportunities.\n""p - AAAtraq (Risk Control Program for ADA compliance issues) published an investigation in 2022 that gave clarity on the severity of the situation. If a university does not comply with Accessibility regulations, “up to $6.62 billion in legal demands alone, but this excludes the cost of ongoing monitoring essential to ensure ongoing compliance” could be required from the university. (Website Accessibility Failure: Why Top US Universities Aren’t Doing Enough for Digital Inclusion - AAAtraq.)\n""p - In the last few years, many institutions for higher education have faced legal actions for failure to abide by these guidelines. This can take the form of lawsuits, threats of taking legal action, government investigations, etc.\n""h3 - Examples\n""p - In 2015, two federal class-action lawsuits were submitted by the National Association of the Deaf (NAD) against Harvard University and the Massachusetts Institute of Technology, stating that many of their open online courses did not comply with Title II of the ADA Section 508 because their content failed to provide appropriately accurate and comprehensive captioning. After years of litigation, an agreement was reached where the two schools complied with a settlement to add closed captions or transcripts to all online content and pay $1,575,000 in court costs.\n""p - Gbossa and Gbossa, “Americans with Disabilities Act (ADA): Is Your Website ADA – Compliant?”\n""p - A similar case happened in 2014 with the University of Montana, where a complaint was filed by the Alliance for Disability and Students of the University because they could not effectively access the school’s websites or the online class materials with assistive technology. An agreement was reached, and the University took actions to develop procedures and policies, taking every effort possible to make all the web content accessible, train faculty and staff, conducting surveys, along with providing the necessary assistive technology to support the needs of low vision/blind students.\n""h3 - Calculate Risk\n""p - Will it be used by the public?\n""p - Information that can be accessed by the public increases the possibilities of receiving complaints about inaccessible content.\n""p - Is it required for a class, course, or office?\n""p - Remember to make content that is adequate for the needs and tools available to the person or department in which it is going to be used.\n""p - Is it going to be continually used?\n""p - Will it be used sometimes in a single class? Or many times in a course? Or will it be required daily?\n""p - Is there a barrier in the content?\n""p - Can I clearly see what I need to fix in my content after making the adequate tests?\n""h2 - Selecting a Content Format\n""p - Even if you do not plan to share content right away, continue to follow best practices to make it accessible. No matter what format you are working with, you must make it accessible for those who need it when requested within 1 business day. We recommend using accessible webpages when possible. PDFs should be a last resort format unless printing is a primary concern. Even if providing a print-ready PDF, consider also including the content in another appropriate format.\n""p - The following questions are intended to guide you to the most appropriate format. They may not be applicable or useable in all scenarios. Through the list if the answer is yes, move to the next level for the format suggestion. If the answer is no, move to the next question at the same level.\n""p - Will the content be updated?\n""p - HTML\n""p - Do you anticipate it being used on a mobile or tablet device?\n""p - HTML or EPUB\n""p - Could it be a webpage?\n""p - HTML\n""p - Is it primarily text and was created as a text document?\n""p - Accessible source document\n""p - Is it created as a presentation format?\n""p - Accessible source document\n""p - Is it a multimedia format?\n""p - Video and audio?\n""p - Accessible source file\n""p - Audio- or video-only?\n""p - Accessible source file with transcript\n""p - Consult with Accessibility Services on best format\n""h2 - Unexpected Challenges\n""p - It isn't possible to prepare for every type of disability and accommodation need. You may come across unexpected situations when you miss an issue, or the resources and time to work with the adequate tools for accessibility are not available at the moment; do not panic, in these cases a contingency plan needs to be proposed. This is called an Equally Effective Alternative Access Plan (EEAAP) that establishes a different and appropriate way to access the information and set a plan that can be continuously maintained and supervised.\n""p - This plan is a supplement for when current software or content cannot support all digital accessibility needs. It means users may not have an equal and equivalent experience, but it is intended to provide an equally effective experience. It will give alternative access to the experience or learning outcome so people with disabilities can obtain the necessary tools and knowledge to participate in their professional and academic activities. It acknowledges that you are aware of the potential shortcomings and that you are making the commitment to including everyone.\n""h3 - Creating an EEAAP\n""p - Creating an Equally Effective Alternate Access Plan (EEAAP) begins with understanding why the plan is needed and who it will serve. The first step is identifying barriers that prevent individuals with disabilities from fully and independently using a digital product, service, or technology. This is typically done through accessibility evaluations, user testing, or review of vendor documentation such as a VPAT/ACR. Once barriers are identified, the plan should outline alternative solutions that will provide equivalent access to the same information, services, or activities. These solutions may include temporary workarounds, alternative formats, or support from staff while long-term fixes are pursued.\n""p - An effective EEAAP also requires defined roles and responsibilities. Accountability must be assigned so that every part of the plan has an owner, whether it is monitoring the vendor’s progress, collecting user feedback, or implementing alternative access solutions. The plan should be reviewed and updated regularly to ensure it remains relevant and effective. Finally, communication is critical. The EEAAP should be shared with all appropriate parties, including faculty, staff, students, vendors, and disability services, so that access is consistently provided in a timely manner.\n""h3 - Components of an EEAAP\n""h4 - Plan Creator\n""p - This section identifies the individual or office responsible for creating the EEAAP. It should include the creator’s name, role or title, department, and full contact information. This ensures accountability and provides a direct point of contact for questions or updates about the plan. If multiple people are involved, list each with their responsibilities clearly defined.\n""h4 - Example\n""p - Name: Jane Doe\n""p - Title: Director\n""p - Department: Office of Information Technology\nEmail: jdoe@college.edu | Phone: (555) 555-5555\n""h4 - Technology Information\n""p - This section describes the technology or digital resource that the EEAAP covers. Include the product name, version number (if applicable), vendor/provider, and a description of its primary use or purpose. Note who will be using the technology (e.g., students, faculty, staff, or the public) and identify the specific accessibility barriers that exist. Clearly state why the technology is necessary and cannot be replaced by a more accessible alternative.\n""h4 - Example\n""p - Product Name: MathPro Online Homework Platform (Version 3.2)\nDescription: A web-based platform that allows instructors to assign and grade homework and students to submit and complete assignments.\nPurpose/Use: Used in all introductory math courses for homework and grading.\nUser Group: Students and Faculty\nScope: Department-wide (Math)\nLifecycle: Adopted in Fall 2025 with a five-year contract.\nAccessibility Barriers: The built-in equation editor is not compatible with screen readers, and graphing tools have low color contrast.\n""h4 - Vendor Information\n""p - Document the vendor’s name, role in providing the technology, and their contact information. Include any accessibility documentation provided by the vendor (such as a VPAT/ACR) and specify whether the vendor has agreed to provide digital accessibility improvements or timelines. This section should also clarify the responsibilities of the vendor versus the institution in ensuring digital accessibility.\n""h4 - Example\n""p - Name: EduTech Solutions, Inc.\nContact: accessibility@edutech.com | (555) 987-6543\nWebsite: www.edutechsolutions.com\nAccessibility Documentation: ACR provided, dated March 2025. Vendor has committed to addressing equation editor accessibility in the December 2025 update.\n""h4 - Potential Digital Accessibility Barriers\n""p - The barrier table is designed to give a clear, structured view of accessibility issues and the steps the institution will take to provide equally effective alternate access. By filling in each part of the table, institutions ensure that digital accessibility barriers are not only documented but actively managed with accountability and transparency.\n""h4 - Repair Information\n""p - This section provides a detailed plan for addressing identified digital accessibility barriers. Include a timeline for fixes or improvements, who is responsible for implementing or tracking the repairs, accommodations available to users while barriers remain, escalation procedures if barriers are not resolved in the planned timeframe.\n""h4 - Example\n""p - Barrier: Equation editor not accessible to screen reader users.\nRepair Plan: Vendor to release accessible version by December 2025.\nInstitution Contact: Jane Doe, Director (Your department).\nAccommodation: Students with screen readers will be provided with an alternative homework submission option (Word or LaTeX documents emailed to instructors). Faculty will be trained on accepting these submissions.\n""h4 - Reviews\n""p - List all stakeholders responsible for reviewing and approving the EEAAP. This should include a combination of line management, IT, Purchasing, Web Accessibility Committee member (external use), Human Resources (employee/faculty use), and Accessibility Services Office (student use). Specify how often reviews will occur and how decisions or updates will be documented.\n""h4 - Example\n""p - Reviewers:\n""p - Jane Doe, Director (Your department)\n""p - Dr. Karen Lee, Chair, Math Department (Faculty)\n""p - Alex Rivera, Director, Accessibility Services Office (Student Support)\n""p - IT Representative\n""h4 - Comments\n""p - This section outlines a process for ongoing evaluation of the EEAAP’s effectiveness. Include a schedule for reviewing user feedback, digital accessibility testing results, or other data points. It may also provide space for documenting challenges, adjustments, or additional support that may be required over time.\n""h4 - Example\n""p - Evaluation: The EEAAP will be reviewed at the end of each semester.\nFeedback: Accessibility Services Office will collect student feedback on the effectiveness of the workaround.\nDocumentation: Comments will be added to this section as accessibility issues are reported or resolved.\n""p - Accessibility Services\nOffice:181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Descriptive Transcripts\n""p - Descriptive transcripts function as a text-based direct alternative to a video or other multimedia. Descriptive Transcript is a direct alternative format of video, not generally used alongside or with a video. The descriptive transcript can be used independently of the video and the user should receive the same information and engage in an equivalent experience as if they watched the video.\n""p - Unlike regular transcripts or captions, descriptive transcripts include both spoken dialogue, sounds, and descriptions of key visual elements, like actions, characters, scene changes, or on-screen text. A descriptive transcript should include three main components: dialogue, sound descriptions, and visual descriptions.\n""p - Quality closed captioning can form the foundation of the dialogue and sound description portions of a descriptive transcript. Audio description can form the basis of the visual descriptions of the transcript.\n""p - The pieces of the transcript should be formatted and structured to be easy to use and understand, including incorporating the aspects and principles of accessibility.\n""h2 - Dialogue\n""p - The speech content, or dialogue, forms the backbone of most descriptive transcripts. It captures all of the spoken words. Accurate, verbatim transcription is essential to allow users to fully understand the content and preserve the original message, tone, and intent.\n""p - Different speakers should be identified in the descriptive transcript. We recommend adding speaker identification to the beginning of the paragraph when a speaker changes followed by a colon.\n""h2 - Sound Descriptions\n""p - Details about the non-speech audio elements are included as sound descriptions. These will include things like music, sound effects, ambient noises, and other auditory cues. In captions we are limited to the timing of the video content on the screen and limited characters of the caption box, in a descriptive transcript there are no such limits.\n""p - We recommend including these in the descriptive transcript in italics and square brackets to off-set them from the spoken content.\n""h2 - Visual Descriptions\n""p - Details about the informational or important visual elements are included as visual descriptions. This will include things like actions, gestures, facial expressions, character descriptions, scene changes, on screen text, or other visual cues helpful for comprehension. The goal is to help the visual nuances be conveyed.\n""p - We recommend including these in the descriptive transcript in italics and square brackets to off-set them from the spoken content.\n""h2 - Resources\n""p - Transcripts | W3C\n""p - Planning Audio and Video Media | W3C\n""p - Descriptive Transcripts for Time-Based Media | Boise State\n""p - Transcribing Audio to Text | W3C\n""h3 - Audio Description\n""p - Is an audio description track or version available including information about all informational visual content not understood from the main soundtrack?\n""p - Is the audio description provided in such a way to not interfere with the original soundtrack?\n""p - Is the audio description synchronized with the video?\n""h2 - Descriptive Transcript\n""p - Is a descriptive transcript available in an easy to find location, and logically associated with the video?\n""p - Does the descriptive transcript include all dialogue, non-speech sounds, and visual descriptions to be a direct alternative to the video?\n""p - Does the descriptive transcript meet accessibility requirements of the format?\n""p - Is each speaker identified each time the speaker changes?\n""p - Does the transcript include logical structure markup?\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Emails\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with emails.\n""p - Email is used widely and is a primary form of communication for businesses. Ensuring your emails are accessible broadens audience reach, engages more users, and allows users to feel more included.\n""h3 - Frequently Asked Questions\n""h4 - When are emails the best format?\n""p - Appropriate use cases include professional or business communication, documentation of interactions, mass communications, and legal or sensitive information\n""h4 - What are the benefits of using emails?\n""p - The benefits of using this format include efficiency reaching a broad audience at their convenience and optimized for search and finding content.\n""h4 - What are the limitations of emails?\n""p - Some limitations include difficulty including complex content (can be worked around by adding an attachment) and too many emails can be overwhelming for some people.\n""h3 - Recommended Software\n""h4 - Microsoft Outlook\n""p - Outlook is an email platform by Microsoft. It is the email that BYU-Idaho students and employees use.\n""h2 - Create\n""p - Learn more about creating accessible emails. The Aspects address the most common digital accessibility issues. Following these principles will help make more accessible and user-friendly content. Best practices are “nice-to-haves” in digital accessibility. Focus on these after applying the aspects.\n""h3 - APPLY THE ASPECTS\n""h4 - Usability\n""p - Keep language simple, clear, and concise\n""p - Ensure all attached files meet the digital accessibility requirements of the format\n""h4 - Real Text\n""h4 - Structure\n""p - Use lists to simplify content\n""p - Limit the use of tables\n""p - Use descriptive linked text\n""p - Tables should formatted for no horizontal scrolling, including on mobile devices\n""p - Use headings to break up content topics and sections\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color\n""p - Use layout options to add spacing\n""p - Pair informational sensory characteristics with a semantic partner\n""p - Ensure color contrast is sufficient between text and background and within images\n""h4 - Visual Content\n""p - Add alt text to all visual elements\n""p - Images, diagrams, and graphics should have descriptive alternative text\n""h3 - Best Practices\n""h4 - Technical\n""p - Run an accessibility check and resolve all the issues if possible. Ensure that any embedded or external resources are accessible as well. If there are other content formats, make sure they readjust on smaller or bigger screens.\n""h4 - Content\n""p - Add a short descriptive subject line, this acts like a title or header that organizes your content. Keep the writing simple, concise, and clear. Make sure that all call-to-actions use actionable and descriptive text. If you add contact information, ensure that it is interactive and selectable.\n""h2 - Evaluate\n""p - This reveals content that is inaccessible but won't guarantee complete digital accessibility. Continue reading for in-depth accessibility checks and practices.\n""h3 - Quick Accessibility Check\n""p - Run an automated checker - Use an automated accessibility checker to review things like color and contrast, images, tables, other structure elements, and access restrictions. If there are any issues, this gives you a good idea of where to start fixing for digital accessibility.\n""p - Descriptive subject line - Review the subject line of the email for clarity and specificity. The subject should provide immediate context and expectation prior to opening the email.\n""p - Simple content and structure - Review the language of the email for simplicity and clarity. The email should be simple and limited to basic structure elements when necessary. Lists and short paragraphs can be used to improve navigation and readability.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Selecting Content\n""p - Accessible emails share many characteristics with accessible websites. They both use semantic headings and HTML structure to display information. Some best practices is to focus on making sure email content uses real text and doesn't have a confusing layout. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Proper headings\n""p - Alt text for attachments/embeddings\n""p - Use plain, understandable language\n""p - Real text(not images of text)\n""p - Descriptive subject lines\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Evaluating Content for Accessibility\n""p - This page covers testing and auditing digital content for digital accessibility. This includes personal testing, procurement audits, and implementing user feedback. This is important for creators, instructors, and purchasers.\n""h2 - Introduction\n""p - When evaluating digital accessibility, there are three main approaches to testing: automated, manual, and user testing. Automated testing uses software tools to quickly scan for common issues, such as missing alt text or low color contrast, and is a useful first step for catching easy-to-spot problems. Manual testing involves a person reviewing content against digital accessibility standards, checking things like heading structures, keyboard navigation, and form labels, which often require human judgment. User testing goes a step further by involving people with disabilities who use assistive technologies in real-world scenarios. Together, these methods provide a more complete picture.\n""h2 - Automated Testing\n""p - Automated testing uses computer programs to scan content for digital accessibility issues. Some platforms come with built-in accessibility checkers while others require separate software or extensions. Automated testing primarily focuses on technical and code compliance, particularly standards like WCAG. Automated testing is quick and efficient and can easily be built into a development process. These tools can scan large amounts of content at once and maintain a high level of consistency in how testing is done. Automated testing will not catch every possible error. While it is good for getting an overview of digital accessibility, it often misses detailed issues that aren't noticeable by a computer. Overreliance on automated testing can create a false sense of security so it is better in combination with manual and user testing.\n""h3 - Built-in Digital Accessibility Checkers\n""p - Often content creation software will have a built-in accessibility checker. These will look for basic issues like missing alt text, bad contrast, incorrect heading levels and so on. Before downloading new software or moving to manual testing, check to see if there are built in tools available. They will usually be in a settings panel or under a heading called “accessibility” or “review”.\n""p - For example, Microsoft Office documents have a Check Accessibility under the Review tab.\n""h3 - External Tools\n""p - If there aren't any built-in tools available, there are lots of options for downloadable tools. These tools often work like extensions that run in a browser or alongside the app. Each content format has different external tools that are applicable.\n""h3 - Next Steps\n""p - Now that you have a basic digital accessibility check of your content, look at the results and fix any issues. If you need help to understand what the results are showing, contact the Accessibility Services Office to set up a quick training or visit the Create page on this website for some basic tips on making your content format more accessible.\n""p - After solving these issues, move on to manual testing. This will help catch other common issues that a computer will not recognize.\n""h3 - Automated Testing Tools\n""p - Note: see the content format pages for more detailed evaluate methods and tools related to each content format.\n""h2 - Manual Testing\n""p - Manual testing focuses on the elements that require human judgment and cannot be fully captured by automated tools. Because this type of testing looks at how real people interact with content, it provides important contextual understanding and ensures complex features are evaluated in ways automated checkers might miss. To be effective, manual testing should follow established guidelines and standards, which provide structure and help ensure comprehensive coverage across different types of content.\n""p - While manual testing offers valuable insight, it also comes with limitations. It can be resource-intensive, requiring time and specialized skills. Results may also vary depending on a tester’s experience or perspective, making consistency a challenge. For large-scale projects, manual testing may be less practical, though it remains an essential part of digital accessibility evaluation.\n""h3 - Keyboard Only Navigation\n""p - Keyboard access ensures that users can navigate to, interact with, and access all content using only a keyboard. Many users rely on keyboards to access content. This could be due to disability (physical limitations or visual impairments), temporary conditions, or individual preferences. Keyboard accessibility often improves the design and usability of content for everyone. A few key benefits of creating content that is keyboard accessible include an enhanced user experience, broader audience reach, and cleaner code and structure.\n""p - The key areas of best practice are focus, interaction, and navigation.\n""h4 - Focus\n""h4 - Interaction\n""h4 - Navigation\n""h3 - Manual Testing Tools\n""p - Note: see the content format pages for more detailed evaluate methods and tools related to each content format.\n""h2 - User Feedback & Testing\n""p - User testing for digital accessibility provides invaluable insights into how well digital content meets the needs of diverse users. Automated and manual testing can catch many technical issues, but they cannot always reveal the lived experience of someone trying to navigate or interact with a product. By engaging directly with people with disabilities, accessibility testing becomes grounded in real-world experiences rather than assumptions. This approach helps ensure that improvements go beyond technical compliance and actually support usability for everyone.\n""h3 - Benefits\n""p - One of the greatest benefits of user testing is authentic feedback. Real users provide perspectives that tools cannot replicate. For instance, students using screen readers, magnifiers, or speech input will show you exactly how your materials function in practice. This helps uncover usability issues that may technically comply with WCAG standards but still cause frustration. User testing ensures that your digital content is not just compliant but also genuinely user-friendly.\n""p - Another benefit is the way user testing fosters empathy and awareness. When faculty members hear directly from students about what works and what doesn’t, it changes the approach from simply “meeting requirements” to building materials that are welcoming and inclusive. Even small adjustments—such as rethinking a confusing layout or improving instructions—can make a significant difference in student success.\n""h3 - Getting Started\n""p - To begin including users in digital accessibility testing, start by looking to your own community. If possible, seek feedback from a variety of students with different disabilities for a wide range of perspectives. Users are the experts in how they use assistive technology so their feedback often highlights barriers that faculty may not notice.\n""p - Listen carefully to their suggestions and look for patterns in the challenges they describe, such as difficulty navigating course modules, unclear instructions, or inaccessible file formats. Even small changes, like restructuring headings in a document or providing captions on videos, can immediately improve usability. When possible, follow up with users to let them know what changes you have made based on their input. This not only validates their effort in giving feedback but also builds a more collaborative and inclusive learning environment.\n""p - Visit the Content Formats page for details on creating or fixing inaccessible content or reach out to the Accessibility Services Office for more guided help.\n""h2 - Laws & Policies\n""h3 - BYU-Idaho's Accessibility Policy\n""p - Our Digital Accessibility Policy says:\n""p - “[Electronic information technologies] used by the University must be accessible to all otherwise qualified individuals, regardless of disability. Likewise, all digital content included in a course, on a web page, shared publicly, or distributed beyond the originating department must be accessible to all otherwise qualified individuals, regardless of disability. … Administrators and staff are responsible for incorporating accessibility in their daily work. … Faculty is responsible for providing an accessible learning environment.\"\n""p - In simple terms, this policy means that anything digital created, shared, or used at the University, whether it’s a course resource, a webpage, a video, or a document, needs to be usable by everyone, including people with disabilities. It also clarifies who is responsible: administrators and staff need to make sure digital accessibility is part of their everyday work, and faculty need to make sure their teaching materials and learning environments are accessible. In short, accessibility is a shared responsibility across the entire university community.\n""h3 - Digital Accessibility Standards at BYU-Idaho\n""h3 - Legal Requirements for BYU-Idaho\n""h2 - Procurement\n""p - The following is general guidelines for accessible procurement practices. Ensure you are following all internal BYU-Idaho policies and procedures with procurement.\n""p - Accessible procurement involves evaluating the accessibility of digital tools and platforms to ensure they meet the needs of a diverse user base. This process is guided by resources that help assess technology for accessibility and usability. Key standards include WCAG, which define accessibility criteria for web and non-web content.\n""p - The Information Technology Industry Council created the Voluntary Product Accessibility Template (VPAT) as a template used to create an Accessibility Conformance Report (ACR). It outlines specific accessibility criteria based on recognized standards such as WCAG or Section 508. Because the this is a voluntary process, there is no guarantee how accurate the report is.\n""p - Before investing in a new product, research and evaluate its accessibility carefully to meet the university's digital accessibility standards and provide a fully inclusive experience. The primary goal of accessible procurement is to select technology that allows all users to perform necessary tasks with comparable ease. This includes assessing usability across all devices and settings (desktop, mobile, etc.) and verifying compatibility with assistive technology.\n""h3 - Purchase Evaluation Steps\n""p - Conduct Internal Accessibility Testing\n""p - Assess Vendor Commitment to Accessibility\n""p - Look into the vendor’s track record for accessibility improvements and their commitment to future updates that will improve digital accessibility.\n""p - Determine Need for an EEAAP\n""p - If the product has known accessibility limitations, determine if an EEAAP is required to provide equally effective alternatives for those impacted.\n""h3 - Procurement Resources\n""h3 - Reviewing Reports\n""p - A VPAT is the blank template that vendors use to report how their product meets accessibility standards such as WCAG or Section 508. Once a vendor fills out this template with actual results, it becomes an ACR. In other words, the VPAT is the form, and the ACR is the finished report that organizations use to evaluate digital accessibility. Since the ACR is the usable version, most people only need to know how to read and understand an ACR. Even though the terms mean different things, they are used interchangeably by many people.\n""h4 - How to Read a VPAT/ACR\n""p - An ACR is typically organized into tables. Each table contains a list of digital accessibility requirements, the vendor’s statement of how well the product meets those requirements, and any explanations or notes. The most important column is the one that states the level of conformance. Common answers you will see are “Supports,” “Partially Supports,” or “Does Not Support.” “Supports” means the product meets the requirement without issues, “Partially Supports” means there are some limitations or exceptions, and “Does Not Support” means the product fails to meet that requirement. The remarks column adds detail to these statements, helping you understand what those ratings actually mean in practice.\n""p - Here’s an example of how part of an ACR might look when based on WCAG 2.1 criteria:\n""p - When reading an ACR, the remarks are just as important as the conformance level. For example, a product may be listed as “Partially Supports” under the color contrast requirement, but the remarks might explain that the issue is limited to one or two buttons that are rarely used. That might not be a critical issue. On the other hand, a “Partially Supports” rating for keyboard accessibility could mean that an entire section of the product is impossible to use without a mouse, which could be a dealbreaker for some users.\n""p - Here’s another sample showing how Section 508 criteria might be reported in an ACR:\n""p - The real value of an ACR is that it goes beyond just saying “yes” or “no” about accessibility. It gives you a clearer picture of how the product behaves in different situations and for different users. By reading the tables carefully, you can determine whether the digital accessibility issues described are small inconveniences or serious barriers. A well-written ACR allows you to make an informed decision about whether the product will work for your audience, and it can also guide you in asking vendors about their plans for fixing accessibility gaps in future updates.\n""h4 - Red Flags in VPATs/ACRs\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Forms & Surveys\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with forms and surveys.\n""p - Survey and form tools are a great way to collect structured information, feedback, and opinions from an audience. They offer inclusive ways to gather data effectively.\n""h3 - Frequently Asked Questions\n""h4 - When are forms or surveys a good option?\n""p - Appropriate Use Cases include gathering feedback in real time from events, performing registration, sign-ups, or contact information collection.\n""h4 - What are the benefits of forms and surveys?\n""p - The benefits include reaching a broader audience with inclusive participation, increased validity of collected data, tailored to have multiple-choice options, dropdowns, or open-text field.\n""h4 - What are the limitations of forms and surveys?\n""p - Some limitations include not all question types can be made fully accessible, accessibility features may require manual adjustments, CAPTCHA systems often create barriers for people with disabilities.\n""h3 - Recommended Software\n""h4 - Microsoft Forms\n""p - A simple, user-friendly tool for creating surveys and quizzes. It's part of the Microsoft 365 suite, offering seamless integration with other Microsoft products for quick data collection and collaboration.\n""h4 - Google Forms\n""p - A free and easy-to-use survey creator. It's known for its strong real-time collaboration features and quick integration with Google Sheets, making it ideal for fast, simple data collection.\n""h4 - Qualtrics\n""p - An advanced, enterprise-level platform for sophisticated surveys and research. It offers powerful analytics and complex logic features, making it the preferred tool for in-depth academic and market research.\n""h2 - Create\n""p - Learn more about form and survey creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Allow users to edit and review information before submitting\n""p - User customizations supported (high-contrast, text size, background color, etc.)\n""p - Content written at appropriate reading level (recommendation: 8th grade)\n""p - Include status or error messages that are associated with input area\n""p - If there are time limits, ensure there is a way to request more time.\n""p - Include a way for users to submit feedback or get help\n""h4 - Real Text\n""p - Text information should be selectable, not be an image of text.\n""p - The language of the form or survey should be set. This will differ depending on the application being used.\n""p - Instructions should be included at the start of the survey or in the label of each question. Ensure that the instructions are easy to understand and see.\n""h4 - Structure\n""p - Break questions up with sections and/or pages.\n""p - Use a descriptive title for the form.\n""p - All buttons should act like buttons, not links.\n""p - Don't use tables for page layout and design, only to show data relationships\n""p - Ensure that all links are attached to descriptive text\n""h4 - Sensory Characteristics\n""p - Convey information independent of color.\n""p - Use layout options rather than blank characters for spacing.\n""p - Dynamically size and space elements for easy activation and user customization.\n""p - Provide errors, alerts, and warnings with context and explanation.\n""p - Ensure color contrast is sufficient between foreground and background for all informational content.\n""h4 - Visual Content\n""p - Visual elements have appropriate text alternatives\n""p - Associate input boxes with their questions (differs for different software)\n""p - The alternatives for visuals should match the context of the question or input field.\n""h3 - Best Practices\n""h4 - Technical\n""p - Any external or embedded resources should also meet digital accessibility requirements.\n""h4 - Flow & Structure\n""p - Include a title that is clear and descriptive. The fields and sections should be ordered in a logical and intuitive manner. This includes grouping similar questions together with clear visual and structural separations between groups. On multi-page forms, include a progress indicator, when possible, to help users know where they are.\n""h4 - Questions & Errors\n""p - Ensure that fields can be filled out using many different input types (single-point touch, keyboard-only, voice, mouse, etc.). The input field instructions should be placed above the question not just as the placeholder text. Any required fields should be marked using more than just color. Any error messages should provide actionable instructions on how to fix the error. Include no response options (not applicable, prefer not to say, no response, etc.) when applicable.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Check Keyboard Navigation - Use the Tab key to navigate through each form field in order. Ensure that each field is accessible in a logical order. Navigation should move sequentially through fields (name, email, phone), and all fields should be reachable with the keyboard alone.\n""p - Verify Labels and Instructions - Hover over each field or activate a screen reader to confirm if each input field is clearly labeled and instructions are present. Each form field should have a label or helper text that describes its purpose (“First Name,” “Email Address”). For screen reader users, labels should be read aloud clearly, indicating what information is expected.\n""p - Run an Accessibility Checker - Use a built-in or third-party accessibility checker tool (WAVE for web forms, Adobe Acrobat for PDFs) to scan for common issues. Review any reported errors or warnings, especially those related to missing labels, low color contrast, and empty fields. Addressing these issues will resolve many accessibility gaps early in the process.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Choosing Content\n""p - Form/Survey builders will generally be more accessible due to their template format. However, making sure all form fields are labeled and there is appropriate alt text is a must. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Contains form field labels\n""p - Clear layout\n""p - Visible focus indicators\n""p - Images have accessible alt text\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to comment your own tips and tricks in the comment section below:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Foundational Knowledge of Digital Accessibility\n""p - Understanding the basic foundation of digital accessibility is necessary for all people, regardless of their ability or job position. This section covers the fundamental principles of digital accessibility, why it matters, and how to think through content in order to move forward in your accessibility journey.\n""h2 - What is Digital Accessibility?\n""p - We define digital accessibility as “the practice of ensuring equally effective and equally integrated functionality, interaction with, and access to digital content for all otherwise qualified users with substantially equivalent ease of use.”\n""h2 - Why Accessibility Matters\n""h3 - Our Mission\n""p - As part of the BYU-Idaho mission, we aim to provide a high-quality education to students of all abilities. Digital accessibility is an essential part of supporting a diverse student body. The Accessibility Services Office assists 5-10% of students. However, data from the National Center for Education Statistics (2019–20) shows that 20.5% of undergraduate students report having a disability. These statistics show a pressing need for accessible accommodations, both digital and physical.\n""p - This need aligns with our mission to:\n""p - “Provide a high-quality education that prepares students of diverse interests and abilities for lifelong learning and employment.” (1)\n""p - Providing accessible content is necessary to fulfill this mission and is part of our responsibility to care for those around us. Accessibility is an essential part of completing this and providing equal opportunity for students to grow academically, socially, and spiritually. We want to support every student on their journey to develop as a disciple of Jesus Christ.\n""p - To learn more about what digital accessibility means and why it is important, visit our page Understand Digital Accessibility:\n""h2 - Accessibility Terminology\n""p - Review a dictionary of common terms used in the digital accessibility world.\n""h2 - The Aspects of Digital Accessibility\n""p - The Aspects were created by the Accessibility Services Office as a beginner friendly way to assess digital content. These Aspects fix the most common digital accessibility issues across many content formats. If you only learn one thing about accessibility, we suggest you learn these!\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Get Rid of Textboxes!\n""h2 - Why are textboxes an accessibility concern?\n""p - Many people rely on textboxes as a simple way to make visually appealing layouts. However, they can present significant accessibility challenges.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Get Started with Digital Accessibility\n""p - This page includes a walk-through of the learning options that are available on this website. Learning about digital accessibility can be daunting so pick a learning method that works best for you, whether it's learning everything in a step-by-step roadmap or picking the specific information you need.\n""h2 - Learn the Foundations\n""p - The Foundations page has all the necessary information to learn before making content. For a quick learning path, we recommend starting here, then moving to the content formats you work with. If you are here to learn about digital accessibility in-depth continue with other resources that this page offers.\n""h2 - Operational Model\n""p - The digital accessibility process is broken down into four main steps: understanding content, creating content, evaluating content, and deciding what content to use. Depending on your work position and lifestyle, these will apply in different ways. Our Content Format pages use this model to illustrate each step of using digital content. Depending on your role on campus we recommend focusing on different steps.\n""h2 - Learning Roadmap\n""p - The Learning Roadmap is a curriculum designed by the specialists at the Accessibility Services Office. It is our recommended path to learn digital accessibility step-by-step. It can be customized to the learner and supplemented with trainings. This is ideal for people that want an in-depth understanding of digital accessibility but don't know where to start.\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Digital Accessibility Hub - Home\n""h1 - Digital Accessibility Hub - Home\n""h2 - Open Trainings\n""p - If you encounter a digital accessibility barrier or issue at BYU-Idaho, please let us know so we can continue to improve. Provide your information to be kept up to date.\n""p - If you need help making your content accessible, please reach out through our contact or create a ticket for a specific piece of content.\n""p - Schedule a training for you or your team through our booking page. For details on the training topics we can provide, refer to our digital accessibility services guide.\n""h2 - Recent Articles\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - HTML\n""h2 - Understand\n""p - Learn more about the basic knowledge needed to work with HTML.\n""p - Hypertext Markup Language (HTML) is the foundational language used to structure web content. It provides the framework that browsers use to display text, images, links, and interactive elements on a webpage. Properly written HTML supports accessibility by ensuring that content is understandable, navigable, and usable for all users, including those who rely on assistive technologies like screen readers. HTML is at its best when it prioritizes semantic meaning, allowing assistive technologies to interpret and present content effectively.\n""h3 - Frequently Asked Questions\n""h4 - When should HTML be used?\n""p - HTML code is an essential element of any website. All content has to be represented through HTML.\n""h4 - What are the benefits of HTML?\n""p - It is easy to build in elements that already have labels and accessible characteristics (i.e. a button element in HTML reads as a button to a screen reader).\n""h4 - What are the limitations of HTML?\n""p - Improper nesting or use of elements may confuse technology like screen readers. User errors can cause critical errors and missing information shared\n""h2 - Create\n""p - Learn more about creating accessible audio files. The Aspects address the most common digital accessibility issues. Following these principles will help make more accessible and user-friendly content. Best practices are “nice-to-haves” in accessibility; focus on these after applying the aspects.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Make sure focus is clear and predictable for keyboard users.\n""h4 - Real Text\n""p - The language for the page is specified using the lang attribute in the <html> tag.\n""h4 - Structure\n""p - Landmark Regions: HTML landmarks like <header>, <nav>, <main>, <aside>, and <footer> provide a clear structure, enabling users to jump between sections quickly. For example, placing your navigation inside a <nav> tag helps users identify it as the main menu. Similarly, reserving the <main> tag for primary content allows users to skip over repetitive elements like headers or menus. This helps create a logical and predictable experience for those who use some assistive technologies.\n""p - Table Structure: When presenting tabular data, use the <table> element along with <th> for headers and <td> for data cells. Headers should be connected to their respective rows or columns using the scope attribute, which helps screen readers understand the relationship between data points. Avoid merging cells or leaving rows empty, as these practices disrupt the table's logical flow for assistive technologies.\n""p - Forms: When designing forms, every input field should have a clear and descriptive label. For instance, instead of simply placing a placeholder inside a field, use a <label> element connected to the input. This ensures that screen readers can announce the purpose of the field, making the form accessible to all users. Additionally, error messages should be dynamically linked to their corresponding fields so users know exactly what needs to be fixed.\n""h4 - Sensory Characteristics\n""p - Ensure sufficient color contrast between text and background. Also consider color blindness when choosing colors.\n""h4 - Visual Content\n""p - Descriptive alt text for images provided.\n""h3 - Best Practices\n""h4 - Semantic Elements\n""p - Semantic HTML elements (e.g., <button>, <nav>, <li>, <article>) convey the meaning and structure of content to assistive technologies. For example, using <button> instead of a <div> styled to look like a button ensures that keyboard navigation and screen readers can identify it correctly. Avoid using generic containers like <div> and <span> when a semantic alternative exists.\n""h4 - Strategic Headings\n""p - Headings (<h1> through <h6>) organize content and improve navigation for users of assistive technologies. They should follow a logical order, starting with <h1> for the main title and avoiding skipping levels (e.g., jumping from <h1> to <h4>).\n""h4 - Keyboard Navigability\n""p - All interactive elements, such as links, buttons, and form fields, should be accessible via keyboard. Test your site by navigating using only the Tab key and Enter or Space to interact with elements. Avoid removing native focus styles without replacing them with clear, visible indicators.\n""h2 - Evaluate\n""p - This reveals content that is inaccessible but won't guarantee complete digital accessibility. Continue reading for in-depth accessibility checks and practices.\n""h3 - Quick Accessibility Check\n""p - Are semantic elements used when one is available?\n""p - Do all form inputs include a programmatically linked descriptive label?\n""p - Are related inputs grouped together?\n""p - Is the language set for the whole and parts as appropriate?\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Remediation\n""p - After evaluating your content, you may find several accessibility issues. Prioritize remediating content that has the greatest impact on the user.\n""p - Once you've decided on the most critical accessibility issues to address, it's time to implement changes. This may involve:\n""p - Semantic HTML: Use proper HTML tags to give the page a logical structure that assistive technologies can read.\n""p - Keyboard Usability: Ensure all interactive elements can be navigated and activated using only the keyboard.\n""p - Accessible Media: Add descriptive alt text to images and provide captions and transcripts for all videos and audio.\n""p - Good Contrast: Use a tool to verify that color contrast meets WCAG standards and avoid using color as the sole means of communication.\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Images\n""h2 - Introduction\n""p - Images play a valuable role in digital content. They provide a second view of information. However, they can also present unique accessibility concerns and challenges. We will review key points and best practices for accessibility with including images in your content.\n""p - These principles can be applied to other visual content as well.\n""h2 - Informative vs Decorative\n""p - Determining if an image is decorative or informative is the first step. Decorative images are present for visual or aesthetic purposes and do not add any informational value to the content. Informative images convey information to the user and require a semantic alternative to convey that informational value to technology.\n""p - Here are some questions to help you determine if you image is informative or decorative. If you can answer “yes” to any of these, your images is probably informative.\n""p - Is the image directly related to the content subject or topic?\n""p - Does the user miss anything if the image is not present?\n""p - Does the image communicate specific data to support the content?\n""p - Is there a clear, defined purpose or message in the image?\n""p - Would understanding of the content be reduced or incomplete without the image?\n""p - If an image is decorative, we want to mark it as such so technology ignores or skips it.\n""h2 - Semantic Alternatives\n""p - A semantic alternative is how we tell technology the importance and meaning of images. Usually these semantic alternatives will usually be a text-based equivalency to the image. One image might have multiple semantic alternatives and all of the semantic alternatives should be distinct from each other. None of the content in one semantic alternative should be repetitive of another semantic alternative.\n""p - Semantic alternatives, in combination, should be able to answer the questions:\n""p - Why is the visual present?\n""p - What will the user miss with no semantic alternatives?\n""p - What is visible?\n""p - Semantic alternatives should not:\n""p - Provide interpretation or analysis of the image\n""p - Add additional information not provided visually\n""p - Repeat information found in the context or other semantic alternatives\n""p - Omit uncomfortable or controversial content, or any informative visual content in the image\n""h3 - Alternative Text\n""p - Alternative text or alt text is a short visual description of the informational value of the image. Every informative image is required to have alt text. Alt text should be the most basic version of what the visual shows. Alt text is limited to a sentence or two (approximately 250 characters or less).\n""h3 - Long Description\n""p - Long descriptions are detail explanations about what is visible in an image when it cannot adequately be contained in alt text. There are no limits on how long a long description can be. Instead of including a long description, you may consider adding information to the context of the image.\n""p - Long description can also include structure, like tables or lists, to help with navigation and organization of content. Long descriptions are particularly useful for complex visuals. Long descriptions can be included in multiple ways and how they are included depends on the content format. Long descriptions should go from the broad information in the image to the details.\n""h3 - Captions\n""p - Captions appear in the content visually for all users. They are useful to enhance understanding and purpose of images for all users. They can also provide context or additional information that may be needed to fully understand the visible information in the image.\n""h2 - Continue Learning\n""p - Tips for Writing Alternatives\n""h2 - Resources\n""p - Images Tutorial | Web Accessibility Initiative (WAI) | W3C\n""p - Poet Image Description Tool | Diagram Center\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - JavaScript\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with elements implemented with JavaScript.\n""p - JavaScript is a programming language that enables interactive web pages. Unlike HTML and CSS, which structure and style a page, JavaScript adds advanced functionality like form validation, dropdown menus, and modals that enhance the user experience. However, when misused, it creates accessibility barriers for people with disabilities.\n""h3 - Frequently Asked Questions\n""h4 - When should JavaScript be used?\n""p - JavaScript can be used to effectively manage focus, announce updates, allow users to modify preferences, and build complex components in websites.\n""h4 - What are the benefits of using JavaScript?\n""p - Interactivity\n""p - Asynchronous content updates\n""h4 - What are the limitations of JavaScript?\n""p - Using mouse events can exclude keyboard access\n""p - Single-page applications require proper handling to communicate dynamic changes\n""h2 - Create\n""p - Learn more about audio-only creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Focus: Use element.focus() in JavaScript to direct attention to key elements (such as forms, error messages, or menus) when they become active. This helps users who navigate with keyboards or screen readers. Return focus to the initial element when a component, like a modal or menu, is closed so users don’t lose their navigation context.\n""p - Form Validation: JavaScript is great for validating forms. Accessible validation should provide clear feedback using aria-live to notify users of errors, along with CSS to visually mark invalid fields. This way, errors are announced in an accessible way. Use aria-describedby on form fields to link them to their corresponding error messages. With aria-invalid and aria-describedby, JavaScript can improve form accessibility, allowing users to receive clear, specific feedback when errors occur.\n""h4 - Real Text\n""p - DOM Text: JavaScript-generated graphics (like <canvas> elements) shouldn’t be the only way text is presented. Instead of drawing words on a canvas, also update a hidden <span> or <div> in the DOM with the same text. If you’re injecting content with innerHTML or appendChild(), make sure the text is actual HTML text nodes so screen readers can read it.\n""p - Text Resize: When changing styles with JavaScript, use relative units (em, rem, %) so text scales properly when users zoom in their browser.\n""p - Dynamic Content: When using JavaScript to update real-time content (like success alerts or error messages), apply aria-live=\"polite\" or aria-live=\"assertive\" to ensure screen readers announce these changes. Roles, such as role=\"alert\" or role=\"dialog\", allow new content to be correctly identified by assistive technologies.\n""h4 - Structure\n""p - Use Correct Tags: Even if you’re adding elements dynamically with JavaScript, create them with the correct tags (still use a button for button elements). This ensures browsers and assistive technologies understand the element’s role without extra ARIA.\n""p - Reading Order: If JavaScript moves elements, make sure the DOM order still matches the visual layout, so keyboard users and screen readers follow the same sequence.\n""p - Control Alternatives: Ensure all interactive elements can be activated with both the keyboard and mouse. JavaScript enables keyboard events (keydown, keyup) to add accessibility to buttons, dropdown menus, and other interactive elements. Use CSS to visually highlight focus on these elements (:focus), helping users see which element is currently active.\n""h4 - Sensory Characteristics\n""p - Add Error Text: If a JavaScript validation script highlights errors in red, also add text like \"Error: Email required\" or an icon with aria-label=\"Error\".\n""p - Color Contrast: When dynamically changing colors via JavaScript, test the new combination with a contrast checker to meet WCAG’s 4.5:1 ratio.\n""p - Audio Sounds: If you use JavaScript to autoplay sound, also insert pause/stop buttons and ensure they are keyboard accessible.\n""h4 - Visual Content\n""p - Alt Text: When JavaScript loads images, set the alt attribute as well. (img.alt = 'Campus map showing accessible entrances';).\n""p - Captions: If you load video with JavaScript, ensure <track> elements for captions are added or link to a transcript below.\n""p - Dynamic Element Descriptions: JavaScript can be combined with aria-* attributes to make dynamic elements more accessible. Attributes like aria-live, aria-label, aria-expanded, and aria-hidden help screen reader users understand the content and state of dynamic elements.\n""h3 - Best Practices\n""h4 - Dropdown Menus\n""p - Dynamic menus can be configured to open with both keyboard and mouse. Add click and keydown events (for Enter or Space keys) and use aria-expanded to indicate the menu state.\n""h4 - Real-Time Alerts\n""p - Use JavaScript to activate notifications or status messages on the page, such as form submission confirmations. Applying aria-live to the container ensures that screen readers announce the messages without interrupting the user.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Test with Assistive Technology - Open your page, turn on a screen reader (like NVDA for Windows or VoiceOver on Mac), and navigate only with the keyboard. Try interacting with JavaScript-driven menus, modals, and sliders to see if they are announced properly.\n""p - Automated Checker - run an automated check with a tool like axe DevTools or Lighthouse, then manually test with the keyboard. This catches accessibility bugs before they become embedded in the code.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Remediation\n""p - After evaluating your content, you may find several accessibility issues. Prioritize remediating content that has the greatest impact on the user.\n""p - Once you've decided on the most critical accessibility issues to address, it's time to implement changes. This may involve:\n""p - Focus Management: Use JavaScript to ensure a logical and predictable flow of keyboard focus, especially for dynamic content like modals or pop-up menus.\n""p - ARIA Live Regions: Implement attributes to alert screen readers when new content appears on the page without a full refresh, such as a validation error or a live chat message.\n""p - Keyboard Interactivity: Add event listeners to custom or non-semantic elements to make them respond to keyboard input.\n""p - Custom Components: Use JavaScript to dynamically update ARIA roles and states to accurately describe their status and behavior.\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Learning Management Systems\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with Learning Management Systems.\n""p - Learning Management Software (LMS) is software designed for the facilitation and management of education, classes, clubs, and other university-centered topics. An example of this type of content is Canvas by Instructure, the LMS that BYU-Idaho uses to structure classes and course content.\n""h3 - Frequently Asked Questions\n""h4 - When should LMS be used?\n""p - Appropriate use cases include large amounts of information or course content, training material, and other collections of data than need to be organized and shared with multiple people.\n""h4 - What are the benefits of LMS?\n""p - The benefits of using this format include seamless integration into other workflows and software for courses, low-coding method for HTML content, and automatic accessibility implementation for certain content formats.\n""h4 - What are the limitations of LMS?\n""p - Some limitations include certain accessibility issues that need to be resolved by the vendor, external or embedded content must meet accessibility requirements as well, third-party software integrated into LMS may not be accessible.\n""h3 - Recommended Software\n""h4 - Canvas\n""p - Canvas LMS is built to make teaching and learning easier for everyone, from the littlest learners to college faculty to business leaders.\n""h2 - Create\n""p - Learn more about creating accessible content. The Aspects address the most common digital accessibility issues. Following these principles will help make more accessible and user-friendly content. Best practices are “nice-to-haves” in accessibility. Focus on these after applying the aspects.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - As you built your content, test that it's still visible and logical if the user magnifies their screen, applies a high-contract theme, or changes their device orientation. Get feedback from students or other users to continuously improve your course.\n""p - Avoid editing the HTML unless it is necessary and you know how. Changing the HTML can lead to accessibility issues if a creator doesn't know how to change the code correctly.\n""h4 - Real Text\n""h4 - Structure\n""p - Build the navigation so it's simple and logical. All modules, groups and other navigation elements should make sense and follow a hierarchal structure. The language and terminology should be consistent across the course.\n""p - Every page should have a unique and descriptive title. Page subsections should be created with headings that the text edit provides. This helps a screen reader understand the setup of a page.\n""p - Do the same thing with table headers when possible. Only use tables to show data relationships not to add layout styling. All links should be descriptive and understandable without other context.\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color or sound. For example, don't instruct users to “read the blue text”, or “press the button when they hear a ding.” If sound or color is necessary for an activity, provide another way to perceive it (a popup or text description)\n""p - Don't use multiple spaces or paragraph breaks. Screen readers will pick up on these and read them aloud. Instead, use the spacing options to create white space.\n""h4 - Visual Content\n""p - All visual content should have a description. For an image provide alternative text and for a video provide accurate captions. For graphs and charts, add necessary data into the alternative text or the surrounding text for context.\n""h3 - Best Practices\n""h4 - Interaction\n""p - All interactive elements, like buttons or links, can be accessed using just a keyboard. Review content by pressing the tab key to move between elements and the enter button to activate. All elements should be highlighted when they have focus. Follow this link to learn more about keyboard testing.\n""h4 - Technical\n""p - All content has passed an accessibility checker. Any external links to resources have been reviewed for accessibility basic practices. Any feedback from users is implemented regularly to update and improve content.\n""h4 - Content\n""p - All content is created with the aspects in mind. This means all visual content has alt text or captions, no pictures of text, all titles and layouts make sense, etc. There are also clear instructions provided before all quizzes, assignments, and discussions. All time limits can be extended or paused.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Check Accessibility\n""p - Run the Automated Checker - use UDOIT and the accessibility checker for the rich text editor in Canvas to identify common digital accessibility issues.\n""p - Check Images for Alt Text - ensure all images have clear, descriptive alt text that conveys their informational purpose or content.\n""p - Review Organization and Consistency - Check that headings are in a logical order (H1, H2, H3, etc.). Ensure organization of the course is easy to follow and navigate. Correct any structure or formatting issues that may hinder navigation.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Choosing Content\n""p - Canvas content has a similar structure to websites. Follow basic practices, such as employing the use of headings and not using images of text to convey information. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Uses accessible, built in, LMS features\n""p - Readable with a screen reader\n""p - Headings and text use proper formatting and tagging\n""p - No images of text\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to comment your own tips and tricks in the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Moving Images\n""h2 - Introduction\n""p - Moving images and animations make content more engaging and fun to use. However, these will require additional considerations for accessibility. Moving images or animations may cause discomfort or health issues for some users. When thoughtfully implemented, moving images and animations can enhance understanding and engagement without causing distraction, discomfort, or distress.\n""h3 - Examples\n""p - GIFs (Graphics Interchange Format)\n""p - Transitions\n""p - Loading Animations\n""p - UI Animations\n""p - 3D Models\n""p - Scroll Animations\n""p - Simulations\n""p - Automatic carousels\n""h2 - Best Practices\n""p - Provide an option to reduce motion or a static alternative\n""p - Test interactive components with a variety technology combinations, including assistive technology\n""p - Add captions and descriptions to provide a semantic alternative to the informational value\n""p - Provide stop, pause, or speed adjustments\n""h2 - Limitations & Cautions\n""p - Avoid flashing or rapidly changing content (more than 3 flashes per second), provide a warning beforehand\n""p - Some users may need adjusted timing to read or interact with content\n""p - Animations and moving images should not be the only means of sharing critical information\n""p - Animations should be long enough for users to comprehend the information\n""h2 - Resources\n""p - Animations | Web Accessibility Initiative (WAI) | W3C\n""p - Making Your Web Animations Accessible: 5 Tips\n""p - Animation, Motion, and Timed Content\n""p - Understanding Success Criterion 2.3.3: Animation from Interactions | WAI | W3C\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - My Media (Kaltura)\n""h2 - How to Upload a Video\n""p - Adding Content to My Media • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""h2 - Help us Find Your Video\n""p - Accessibility Services can support your efforts to provide captioned videos. To make sure we can find your videos when needed, please complete the metadata fields for your uploaded videos.\n""h3 - Tags\n""p - Add a tag to the video that includes your course code and number (ex. MATH 304).\n""p - Add a tag to the video that includes the week number the video is used in your course (ex. W02)\n""p - If the video is not for a course, add a tag with the location, office, or event.\n""h3 - Hearing Impaired\n""p - Choose “Yes” if you have received a captioning accommodation request.\n""p - Choose “No” for all other reasons.\n""h3 - Video Purpose\n""p - One or Two Semesters: select this option if your video is only for a limited time. Examples include things like office hours, Zoom meetings, or other videos you do not plan to use again.\n""p - Long running course: select this option if you will be using the content for longer than two semesters.\n""p - Master Course for Online Learning: select this option if the video appears is a master course (campus or online) that will be used in multiple sections for the foreseeable future.\n""p - Campus wide broadcast/communication/website: select this option if the video will be posted publicly on a BYU-Idaho website, social media, YouTube, or other platform. Anything that has a publishing status of public will use this option unless in a course.\n""p - None of the above: select this option if none of the others fit your video use. This option should also be used by students submitting videos for assignments.\n""h3 - Publishing Status\n""p - Unlisted will make the video available only through the link; it will not be available through a search on video.byui.edu. This is the recommended publishing status for most course videos.\n""p - You may need to access My Media through video.byui.edu to use the Unlisted status.\n""p - Published will be used for videos made public on video.byui.edu. These can be found through the search feature.\n""p - Private videos are only viewable by you or co-editors/owners/publishers. Other users will not be able to view, even if they have a link.\n""h2 - Adding Videos to Canvas\n""p - Share Video: Embed Media in Canvas • Resource • BYU-Idaho Learning and Teaching (byui.edu)\n""h2 - Finding the Kaltura ID\n""p - Accessibility Services wants to help support you in your efforts to provide accessible content. In order to help you with your specific video, Accessibility Services may ask for the Kaltura ID. You can find this ID in several places. The Kaltura ID is a number or letter followed by an underscore and eight more numbers and letters (example: 1_3wsu3c5t).\n""p - If you open the video in video.byui.edu, the Kaltura ID will be at the end of the URL in your address bar.\n""p - If you open the video in edit mode from My Media, the Kaltura ID will be in the Basic Info panel as Media Entry ID.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - PDF Documents\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with PDF documents.\n""p - PDFs are a widely used and versatile document format, ideal for preserving layout consistency and ensuring content looks the same across devices. They are commonly used for forms, reports, instructional materials, and archived documents. However, while PDFs can be an effective way to share static content, they come with unique digital accessibility challenges.\n""h3 - Frequently Asked Questions\n""h4 - When are PDFs the best format choice?\n""p - Appropriate use cases include forms, complex tables with limited HTML options, a need to maintain a specific format or layout, creating a document that will never change (such as official documents), or archiving content.\n""h4 - What are the benefits of PDFs?\n""p - The benefits of using this format include the possibility of adding tags that make content understandable to the computer, can be used as a digital file or printed file. PDFs are robust or complex documents that maintain formatting, this is helpful for legal documents.\n""h4 - What are the limitations of PDFs?\n""p - Some limitations include challenges updating or changing content, time-consuming and difficult to remediate, not conducive for viewing on small screens, such as a mobile device, more work is required to make a PDF accessible.\n""h3 - Recommended Software\n""h3 - Adobe Acrobat Pro\n""p - Adobe Acrobat is one of the only software available for making a PDF completely accessible. Consider downloading it and exploring its features.\n""h2 - Create\n""p - Learn more about creating accessible PDFs. The Aspects address the most common digital accessibility issues. Following these principles will help make more accessible and user-friendly content. Best practices are “nice-to-haves” in digtial accessibility. Focus on these after applying the aspects.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - All elements should be spaced and sized for easy activation. Check that everything makes sense and can be accessed, even in different screen sizes.\n""p - Review the tag tree and make sure everything is in a logical order. In Adobe Acrobat this option is under Accessibility > Reading Order or Tags. If the document has any links or interactive elements, ensure they can be accessed using just the keyboard (press tab to navigate and enter to activate).\n""p - When applicable, help or contact information should be placed in the same spot consistently, whether that's on each page or at the end of each document.\n""h4 - Real Text\n""p - Set the language of the document. This is different depending on the document format. In Adobe Acrobat go to File > Properties > click the Advanced tab > Reading Options > select the language from the Language dropdown.\n""p - Create tags for all informational text (this is only possible in Adobe Acrobat). Without tags a PDF can't be made completely accessible.\n""p - Use the page numbers tool instead of numbering pages manually.\n""p - Any information that repeats or doesn't add meaning should be made an artifact.\n""h4 - Structure\n""p - Ensure that all headings follow a hierarchal structure (H1, H2, H3, etc). There should only be one H1 per document that acts as the title.\n""p - If there are bookmarks, ensure they match up with the heading structure.\n""p - Any tables should have marked header cells, as well as a scope when needed. Adding these varies depending on the document.\n""p - All links should have a OBJR tag. These can be added manual in the Tags panel. However, Adobe Acrobat will automatically add a OBJR (Object Reference) tag to any interactive element that is tagged properly, so double check in the tag tree first.\n""p - Review that content is appropriately tagged with the correct tag type.\n""p - If list labels are separate from list item bodies, there should be an alistnumbering attribute applied.\n""h4 - Sensory Characteristics\n""p - Information should not use color to convey it's meaning on its own. If color is used to convey meaning, create an alternate way to get the same information.\n""p - Convert non-informational content to artifact (i.e. multiple blank characters for white space and layout).\n""p - Use a color checker to check all text and images have the correct contrast ratio.\n""h4 - Visual Content\n""p - As with all documents, visual elements must have alternative text. If an image's meaning is already mentioned in the paragraph text it doesn't need to be mention again in the alternative text.\n""p - Charts and graphs should have meaningful descriptions and data. When needed add additional captions or alternative text to explain the purpose fully.\n""h3 - Best Practices\n""h4 - Technical Guidelines\n""p - Give the file a descriptive title that explains the purpose of the document.\n""p - If the PDF was converted from another file, ensure that the original file meets all digital accessibility guidelines for its format.\n""p - Check that all external or embedded resources meet digital accessibility requirements for its format.\n""p - When the document is finished check it across different devices and resolutions to ensure it is still visible.\n""h4 - Tag Considerations\n""p - Field labels should be visual to the human eye and coded so a computer can interpret them.\n""p - If content spans multiple pages, ensure that the content has a singular tag instead of a tag for each page.\n""p - When testing a PDF document ignore the pages in the tag tree structure.\n""h2 - Evaluate\n""p - This reveals content that is inaccessible but won't guarantee complete digital accessibility. Continue reading for in-depth accessibility checks and practices.\n""h3 - Quick Accessibility Check\n""p - Run Automated Checker - Use an automated checker (built-in to Adobe Acrobat, PAC, etc.) to review common digital accessibility issues. Review any errors or warnings. This gives you a good idea of where to start.\n""p - Review Tag Tree - Use your arrow keys to navigate through each element of the tag tree. Look for appropriate structure tags. Watch to make sure all informational and important content is tagged.\n""p - Select Text - Select text on multiple pages, select entire pages, select across columns, and so on. Make sure that selected text is in a logical selection order and columns are appropriately marked up.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible..\n""h3 - Selecting Content\n""p - In general, PDFs are not inherently accessible. All items in a document must be tagged to be legible for those using screen readers. PDFs will need to be manually inspected for proper tags and heading structure, and to make sure that they are usable with a keyboard. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Is tagged in order\n""p - Form fields are tagged as such\n""p - Visual content has alternatives\n""p - Decorative elements are tagged\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Presentations\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with presentations.\n""p - The presentations format covers all parts of a presentation, from the displayed materials, speaker delivery, and shared media. We highly recommend for presenters to write a speaker script prior to presenting materials to assist with flow, limited filler words, and ensure that accessibility deliver practices have been considered.\n""p - Presentation display materials can be achieved with a variety of formats, including: Microsoft PowerPoint, Google Slides, Canva presentations, PDF, HTML, and so on. Some of these are more accessible and easier to make accessible than others. Use your best judgement when choosing your format for displayed materials.\n""h3 - Frequently Asked Questions\n""h4 - When should presentation be used?\n""p - Presentations are best for educational settings with a broad or unknown audience needs, trainings and workshops, public events, and virtual meetings and webinars.\n""h4 - What are the benefits of presentations?\n""p - Presentations combine supporting displayed materials with live presentation and interaction for real time clarification, they provide multiple means of conveying information, and display materials can support and help control presentation pace, clarity, and organization.\n""h4 - What are the limitations of presentations?\n""p - When giving a presentation trying to be clear and concise may oversimplify complex concepts, cluttered and overfilled displays can cause confusion and overwhelm for audience, and inconsistent pace may not allow for processing and understanding.\n""h3 - Recommended Software\n""h4 - Microsoft PowerPoint\n""p - A feature-rich presentation software with extensive tools for professional slide shows. It provides robust control over animations, transitions, and multimedia, making it a powerful tool for complex presentations.\n""h4 - Google Slides\n""p - A free, web-based presentation tool known for its real-time collaboration. It allows multiple users to work together seamlessly and is an excellent choice for simple presentations that require easy sharing.\n""h4 - Canva Presentations\n""p - A user-friendly presentation maker focused on visual design. It offers a vast library of templates and a drag-and-drop interface, making it easy for anyone to create professional-looking and visually engaging slide shows.\n""h2 - Create\n""p - Learn more about presentation creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Use consistent and predictable slide organization and design\n""p - Remove automatic timing and transition animations on shared files\n""p - Verify the Reading Order and Selection Pane for all slides\n""p - All text content should show in the outline view, in a logical order\n""p - Transitions are smooth and not disorienting or distracting\n""h4 - Real Text\n""p - Use simple, clear, and short text pieces\n""p - Use large, clear font\n""p - Use fonts that are consistent, legible, and accessible to all audiences\n""p - Text information should be selectable and accurate, not an image of text\n""h4 - Structure\n""p - Slides have descriptive titles for their content\n""p - Slide order reflects a logical progression of ideas\n""p - Links are easy to interact with from display text or URL as the audience\n""p - All data relationships are shown with a table\n""p - The appropriate type of lists are used to group related content\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color\n""p - Keep display materials simple and not overcrowded\n""p - Verbally describe visual relationships between content\n""p - Informational sensory characteristics are described by the speaker and paired with a semantic partner in shared files\n""p - Color contrast sufficient between text and background and other informational components\n""p - Color choices complementary and easy to distinguish\n""h4 - Visual Content\n""p - Verbally describe informational visuals\n""p - Include long visual descriptions in speaker notes or on a hidden slide\n""p - Multimedia elements are supported with captions or transcripts\n""p - Visuals are designed to maintain clarity across different devices and screen sizes\n""h3 - Best Practices\n""h4 - Content\n""p - Write speaker notes to clarify, expand, and explain the displayed content, this is especially beneficial when sharing the presentation with others. Ensure that the information flows in a natural and logical way.\n""h4 - Design\n""p - Design the slides so that information is easy to read or see. The text should be large and legible, with sufficient spacing. Fonts should consistent and easy to read. Any visual content should be big enough for the audience to see.\n""h4 - Script & Delivery\n""p - Consider writing a script or speaker notes to make sure you hit all the important points. Include a description of all visual content and include what the relationship is or why the information is valuable. Define all jargon, technical terms, and acronyms. Deliver the presentation at a moderate pace, with pauses for the audience to process or ask questions. When a question is asked, restate it to ensure you understand and so the whole audience can hear.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Run an automated checker - Use the Accessibility Checker (review tab) to review color and contrast, media and illustrations, tables, structure, and access. If there are any issues, this gives you a good idea of where to start.\n""p - View display content in greyscale - Set the slides to greyscale (accessibility tab) and confirm color contrast is sufficient. Double check that color is not the only method of conveying meaning.\n""p - Skim speaker script for flow - Use the speaker script to identify flow of presentation. Double-check there are logical pauses and room for questions, concepts build progressively, and content per slide is consistent.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Selecting Content\n""p - Presentations will often come in a variety of formats and filetypes. If slideshows follow good file conventions or are based off of predefined templates, they should be usable with a screen reader. Annotating a slideshow and making sure charts and graphs have good alt text/long description is vital. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Images and graphs have effective alt text and/or long descriptions\n""p - Color is not the only method of displaying information\n""p - Sufficient contrast\n""p - Helpful annotations\n""p - Transcriptions for the audience can be beneficial\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Real Text\n""h2 - The Principle\n""p - If something looks like text and is meant to be read as text, it should be real text—not an image of text.\n""p - Real text ensures people and technology can understand and interact with content. Often those with disabilities rely on assistive technologies, like screen readers, for more information. When text is presented as an image, screen readers cannot interpret or read it aloud, creating a barrier for users who depend on these tools.\n""h3 - Incorrect: Image of Text\n""p - In addition to being unreadable for a screen reader, images of text can be unclear for users that apply magnification or contrast themes.\n""h3 - Correct: Textbox\n""p - It is better to use actual text for any kind of written content. This includes math and writing in other languages.\n""p - University\n""h2 - How to Apply\n""h3 - Language of Page\n""p - Text needs to be defined so the computer knows what language is being used. This is especially important when more than one language is used. How to do this will vary depending on the format of content.\n""h3 - Avoid Scans\n""p - Scanned files are the same as images of text and cannot be read by a screen reader. If possible, start from the original document to create an accessible version. If no digital original exists, make sure the scanned file is a clean, high-quality scan. Then work to make the scanned version accessible. Also consider other sources that convey the same information.\n""h3 - Customizable Text\n""p - Users should be able to customize and consume text in their preferred manner. Some users may need to change the font, size, or spacing of the text. Others may have technology read it aloud. Consider how your design is affected by different text.\n""h3 - Avoid Using Characters for White Space\n""p - Avoid using the space bar or enter to create white space. These create unseen characters that a screen reader will pick up. Rather, use the built-in spacing settings for paragraphs and line spacing.\n""h3 - Math Real Text\n""p - Avoid using images of any math equations or other scientific characters. Instead find programs that display these as interactive elements. For example, math can be included as an interactive element using MathML.\n""p - Real text ensures that all characters can be interpreted by a computer. This helps people with screen readers to understand all the information on a page. It also provides more consistent digital content.\n""p - Continue to the next aspect to keep learning:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Resources for Accessibility\n""p - This page provides more resources for learning about digital accessibility. This includes articles written by the digital accessibility specialists, open training powerpoints, and ways to get involved.\n""h2 - Articles\n""h2 - Accessibility Services Guide\n""h3 - Open Trainings\n""p - Open trainings are held at least six times per year, in February, March, May, June, October, and November. Our rotation of topics includes Word, PDF, PowerPoint, Canvas, videos, and the aspects. Look at our events page for more details.\n""h3 - Personalized Trainings\n""p - Personalized trainings are held upon request with individuals or groups. When requesting a training, please share information about topics of interest, group size, preferred location, and time available. For topic ideas see our list of possible topics in Training Topic Ideas.\n""h3 - Assessment & Review\n""p - Send us content, through email or submit accessibility assistance request, that you want us to review or help fix and we will preform a basic assessment and talk with you about options that are available.\n""h3 - Training Topic Ideas\n""h2 - Open Training Files\n""h2 - Engage Community\n""p - Improve your digital accessibility! Ask questions, share ideas, get resources, and learn about creating and evaluating with accessibility in mind by joining our group on Engage:\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Sensory Characteristics\n""h2 - The Principle\n""p - A user should not need to hear or see to understand or interact with content. Sensory characteristics (even in combination) should not be the only means to understand, operate, or interact with content. Sensory characteristics include location, sound, color, shape, size, and orientation. Each of these on their own can be limiting. But when combined with information the computer can recognize, they provide additional dimension to our content.\n""h2 - Color Best Practices\n""p - Contrast - Contrast refers to the difference between the foreground and background colors. If colors are two similar, it can make it harder to perceive. ratios are used to determine if the contrast is high enough. Sufficient contrast is defined as\n""p - 4.5:1 for normal text\n""p - 3:1 for large text or user interface components (large text is defined as 14 pt and bold or 18 pt or above.)\n""p - Combinations - Color blindness and other color deficiency disorders may make it hard to tell certain color combinations apart. There are many different types of color blindness and color deficiency disorders. High-contrast, patterns, shapes, and labels can all be helpful to use alongside color to help relieve this concern. It's helpful to view content in greyscale to verify that color is not the only way information is conveyed.\n""h3 - Color Button Example\n""p - Incorrect Use of Color - color should not be the only way to identify the instructed actions.\n""p - Correct Use of Color - color should be paired with text both in the instructions and in the button (or other action).\n""h2 - Orientation Best Practices\n""p - Orientation refers to the way content is displayed. There are two main types: portrait and landscape. Content should be designed to work with either orientation. Here are a few important reasons:\n""p - Large Text - some users may enlarge the font size. When this happens, they should be able to navigate without two-dimensional scrolling (horizontal and vertical) because it can become very tedious, and the content can be hard to understand. Text should reflow to fit the screen size.\n""p - Fixed Devices - some users in wheelchairs have their devices fixed to their chair in one orientation and if the content does not reflow to that orientation your content may not be usable by them.\n""p - Consistency - some users may be confused if content automatically switches to a specific orientation. Keeping content fluid to match their current orientation removes this unexpected change.\n""h2 - Location Best Practices\n""p - Content needs to be easy to locate. This is particularly important when content is referenced in other places.\n""p - Locating Elements - If you reference a diagram on the left but the user has enlarged the content or changed the orientation, the diagram might appear in another spot. Instead of using the location as a reference, try using the diagram caption or title.\n""p - Navigation - navigation menus and help should be in a consistent location throughout your content to make them easy to find. This helps users navigate effectively without spending extra time trying to understand the setup.\n""p - Sensory Characteristics aspect helps users understand content even if they can't see color or hear sound. It also ensures users can apply different settings to their devices and still navigate content effectively.\n""p - Continue to the next aspect to continue learning:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Software\n""h2 - Understand\n""p - Learn about the content format and common digital accessibility issues before moving forward.\n""p - Developing accessible software ensures that your product reaches the audience you intend to use it in a way that they can use it. The format of software specifically talks about software applications (mobile or desktop).\n""h3 - Frequently Asked Questions\n""h4 - What uses does software formats have?\n""p - Appropriate use cases include offline access, long-term cost and stability, low-latency performance, legacy integration, and regulatory compliance.\n""h4 - What are the benefits of software?\n""p - The benefits include improved usability and user experience for everyone, expanded market reach, enhanced brand reputation, improved search and indexing functionality, cost reduction to design and develop with accessibility from the beginning of the process.\n""h4 - What are the limitations of software?\n""p - Some limitations include resource-intensive testing and quality assurance for compliance, risk of overcomplex design, communication and annotation mistakes between design and development, over-simplification may alienate advanced users.\n""h2 - Create\n""p - Learn more about software creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Software should be responsive to user customization (screen size, magnification, accessibility settings, auto-fill, etc.)\n""p - Communicate and associate error and status messages (semantically and visually)\n""p - Users can submit accessibility barriers and feedback\n""p - All content can be accessed and interacted with various input types without traps.\n""p - Focus is predictable, visible, and logical.\n""h4 - Real Text\n""p - Clearly annotate designs and wireframes.\n""p - Make text selectable and accurate.\n""p - Set the language when possible and needed.\n""p - Add comments to code to aid in debugging and future updates.\n""h4 - Structure\n""p - Pages and dialogues have descriptive and unique names.\n""p - Different structural elements are consistent and unique from other elements and used as they are intended.\n""p - Group similar items together.\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color.\n""p - Dynamically size and space elements for customization and easy of activation.\n""p - Pair informational sensory characteristics with a semantic partner.\n""p - Color contrast should be sufficient between foreground and background colors of informational content.\n""p - Form labels are associated visually and semantically with their input.\n""h4 - Visual Content\n""p - All meaningful visuals (videos, images, diagrams, etc.) have an appropriate semantic alternative (alt text, long description, descriptive transcript, etc.)\n""p - Functional visuals (links, buttons, etc.) should have a semantic alternative that conveys their function.\n""h3 - Best Practices\n""h4 - User Interface\n""p - Is the application designed to be usable on various screen sizes, resolutions, orientations?\n""p - Are custom controls and elements designed with digital accessibility in mind?\n""p - Are keyboard shortcuts available and customizable by users?\n""p - Are inputs provided with visual and semantic instructions, hints, or tips?\n""p - Can actions be reviewed or edited before finalization or undone after?\n""h4 - Technical\n""p - Does the application support devices accessibility settings on all platforms supported?\n""p - Has an accessibility conformance report been completed?\n""p - Do external and embedded resources meet accessibility requirements of the format?\n""p - Is the code annotated with notes including accessibility behaviors?\n""p - Does documentation include accessibility information?\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Run automated accessibility tests - Use a linter or other automated accessibility testing tools to check for code-based accessibility problems. If there are any errors or warnings, this gives you a good idea of where to start fixing digital accessibility.\n""p - Keyboard and Focus - Use the Tab key to move through the application. Ensure you can access all interactive elements and that each receives visible focus. Pay attention to the order of elements.\n""p - Check Color Contrast - Look for any text or UI components that are hard to read due to poor contrast with the background or size. Ensure all states of all elements retains sufficient contrast from other states.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Selecting Content\n""p - Software accessibility can be more difficult to determine. Generally, widely used and well-known software will be No suggestions more accessible. It is also worth checking out what accessibility tools exist in the settings of the software if they exist. Those can be a good indicator to see what the software offers and if accessibility is taken seriously. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Keyboard navigable\n""p - Compatibility with screen readers\n""p - All non text content has an accessible, text-based alternative\n""p - Accessibility tools and settings exist\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Spreadsheets\n""h2 - Understand\n""p - Learn about the content format and common digital accessibility issues before moving forward.\n""p - Spreadsheets are a useful tool to organize, analyze, store, and share data. Spreadsheets typically include data organized in rows and columns and generally allow data to be added, manipulated, and visualized in different ways. Spreadsheets are especially helpful in organizing large or complex data outside of a database.\n""h3 - Frequently Asked Questions\n""h4 - When are spreadsheets the best format to use?\n""p - Appropriate use cases include structured data, static data to share with others, complex calculations, raw data shared, collaboration with data, not complex or large enough to need a database.\n""h4 - What are the benefits of using spreadsheets?\n""p - The benefits include better user experience for everyone (navigation, understanding, editing, consistency), improved collaboration, increased reach to those with varying devices and technology.\n""h4 - What are the limitations of using spreadsheets?\n""p - Some limitations include content without headers lead to misidentification of content, complexity of data increase's chance for confusion and misunderstanding, not all functions are accessible, planning and design needed before spreadsheet is created\n""h3 - Recommended Software\n""h4 - Microsoft Excel\n""p - Microsoft Excel is a powerful, feature-rich spreadsheet application used for data organization, analysis, and calculation.\n""h4 - Google Sheets\n""p - Google Sheets is a free, web-based spreadsheet program that is part of Google's suite of office tools. It is known for its strong collaboration features, allowing multiple users to edit a document simultaneously in real-time.\n""h2 - Create\n""p - Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Remove any blank worksheets.\n""p - Hide unused columns and rows.\n""p - Content should follow a logical progression and meaningful order.\n""p - Formulas and calculations are clearly labeled for comprehension.\n""h4 - Real Text\n""p - Use typed text for text.\n""p - Sheets should have text or content in cell A1.\n""p - Informational and interactive content should not be protected or restricted.\n""h4 - Structure\n""p - Add descriptive names for worksheets.\n""p - Tables, cells, and ranges should have clear names.\n""p - Links should be in a cell by themselves and hyperlinked.\n""p - All tables should have appropriate visual and semantic headers.\n""p - Lists should be formatted as a single-column table.\n""p - Links should have descriptive display text.\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color.\n""p - Keep worksheets simple and not overcrowded.\n""p - Have row heights and column widths adjusted to provide adequate white space.\n""p - Color contrast should be sufficient for all informational elements.\n""h4 - Visual Content\n""p - Include long descriptions of complex visuals in a logical or linked location.\n""p - Visual elements are positioned logically and are easy to interpret.\n""p - Charts, diagrams, and graphs include alternative text or explanations.\n""p - Visualizations are free of unnecessary or confusing clutter.\n""p - Graphs and charts have a connected accessible table of data.\n""h3 - Best Practices\n""h4 - Data\n""p - Is formatting consistent for numeric values?\n""p - Is data validation applied when applicable with appropriate error message assistance?\n""h4 - Organization\n""p - Did you freeze rows in large bodies of data to assist with navigation and context?\n""p - Is the structure of each spreadsheet logical?\n""p - Are instructions, explanations, or help information found in a consistent and logical location?\n""p - Has metadata been added to identify purpose?\n""h4 - Visualization\n""p - Is color supported by a pattern, shape, or label?\n""p - Are all axes and data points in visualizations clearly labeled with context?\n""p - Are data visualizations located near or otherwise connected to their data?\n""h4 - Technical\n""p - Are unnecessary rows or columns removed or hidden?\n""p - Did you run an accessibility checker and resolve all issues?\n""p - Do external and embedded resources meet accessibility requirements of the format?\n""p - Are all informational cells available to and readable by technology?\n""p - Has content been reviewed and/or created with the aspects in mind?\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Run an automated checker - Use an accessibility checker to review for use of color and contrast, alt text, table headers, merged cells, sheet names, and access restrictions. If there are any issues, this gives you a good idea of where to start fixing digital accessibility.\n""p - Relational data formatted as tables - Look through each sheet to identify any relational data and check if it is in a table. Verify that each table has appropriate header cell designations and a table title.\n""p - Text in A1 on every sheet - Look through every sheet in cell A1 to verify there is content. If a sheet is blank, delete it. If it starts farther on the page, A1 may contain instructions or a description.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Selecting Content\n""p - Spreadsheets can be more difficult to determine accessibility. Tools such as the accessibility checker from Microsoft Excel can aid in finding most common problems. Google Docs doesn't have a built-in accessibility checker, but there is an Add-On called Grackle Docs that can do something similar. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - No merged or split cells if possible\n""p - Have good color contrast and avoid communicating information only through color\n""p - Has text in cell A1\n""p - Alt text for images\n""p - Straightforward layout\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - STEM\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with STEM based content.\n""p - Science, Technology, Engineering, and Mathematics (STEM) is particularly challenging to make accessible. Even with recent advances making content in these fields more accessible, there are still aspects that remain very difficult to convey in digitally.\n""p - Making STEM content fully accessible will combine digital content techniques, physical or tactile formats, and alternative formats and supplements. It is not as simple as just providing caption and alternative text, but rather ensuring the complex data, diagrams, formulas, code samples, and interactive elements are presented as comprehensively and completely as possible in a combination of mediums.\n""p - Traditional methods for teaching and presenting math can pose significant challenges for individuals with disabilities. However, designing content with accessibility in mind should help eliminate some of these barriers. The most accessible form of math is MathML, which allows for the creation of interactive math content. However, if no other option, you can add alternative text or another semantic alternative to an image or static representation. It is worth noting that this is the only possibility for PDF, so math is never fully accessible in this format.\n""h3 - Frequently Asked Questions\n""h4 - When is STEM content most useful?\n""p - STEM content is best for displaying complex technical information, such as graphs, math formulas, and other technical content.\n""h4 - What are the benefits of using STEM formats?\n""p - Benefits include developing a systematic and logical approach to problem-solving, fostering creative and innovative thinking through experimentation, demonstrating the real-world application of theoretical knowledge, and promoting interdisciplinary connections between different subjects.\n""h4 - What are the limitations of using STEM formats?\n""p - Most content formats are primarily text-based\n""p - Subject-matter experts required to provide correct and exact information needed\n""p - Interactive and virtual lab tools may be inaccessible with assistive technology\n""p - Adoption of new markup languages is inconsistent between platforms and technology\n""h3 - Recommended Software\n""h3 - MathML\n""p - MathML (Mathematical Markup Language) is an XML-based language used to display complex mathematical equations and symbols on the web. Think of it as the HTML for math. It provides a standardized format that's both structured and semantically meaningful, which makes the content accessible to both people and computers.\n""h4 - How is MathML Created?\n""p - You can create MathML in a couple of ways:\n""p - Hand-coding: You can write the markup yourself.\n""p - Using tools: You can use software like the MathType equation editor, which generates the MathML code for you.\n""h4 - The Role of MathJax\n""p - While MathML provides the structure, it needs a way to be displayed correctly. This is where MathJax comes in. MathJax is a JavaScript display engine designed specifically for mathematics that ensures math content looks right in all browsers.\n""p - Some applications, like the Canvas Rich Content Editor (RCE), use LaTeX code and then translate it into MathML. MathJax then takes this MathML and renders it properly, so what you see is a well-formatted equation, not a string of code.\n""h3 - LaTeX\n""p - LaTeX is another popular tool for typesetting complex mathematical formulas and equations. While traditionally used in academic research and scientific writing, LaTeX is also a valuable tool for creating accessible math content in digital formats. When used properly, LaTeX can be combined with screen reader-friendly tools to ensure that math content remains accessible.\n""h3 - Microsoft Word Equations\n""p - Microsoft Word includes a built-in equation editor that supports the creation of accessible math content, though it’s important to follow best practices to ensure compatibility with screen readers and other assistive technologies. There is a gallery of prebuilt equations that you can chose from, or you can write your own equations and add them to the gallery.\n""h3 - Canvas Rich Content Editor (RCE)\n""p - You use the RCE to add content, structure, and formatting to Canvas. You have two different options for adding accessible math.\n""h4 - Using LaTeX in RCE\n""p - In your Canvas course, navigate to the location where you want to include math content.\n""p - Click on Insert Math Equation (under More or the Insert menu) in the RCE.\n""p - Toggle Directly Edit LaTeX on, and start writing the content in the input field.\n""p - Always preview your content to ensure that the math renders correctly before publishing.\n""p - This adds an image of the math in the RCE with the LaTeX as alt text. But when the page is saved, the math is rendered using MathML and MathJax.\n""h4 - Using MathML in RCE\n""p - In your Canvas course, navigate to the location where you want to include math content.\n""p - Click on the HTML editor button in the RCE.\n""p - Add the MathML in the desired location\n""p - Always preview your content to ensure that the math renders correctly before publishing.\n""h2 - Create\n""p - Learn more about STEM content creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Validate Your MathML: Use online validators to check that your MathML is error-free and adheres to standards.\n""p - Use the Built-in equation editor: Alway utilize the Equation Editor to ensure proper formatting and accessibility.\n""h4 - Real Text\n""p - Keep Equations Simple: Use clear, concise LaTeX code to represent basic formulas and equations. Avoid overly complex notation that may confuse screen reader\n""p - Use Semantic Markup: Ensure that your LaTeX code is logically structured to enhance accessibility. For example, use proper fractions (\\frac) instead of attempting to create fractions using slashes.\n""h4 - Structure\n""p - Semantic Structure: When creating math using MathML, make sure that every element (e.g., fractions, exponents, roots) is properly tagged with the corresponding MathML element. This ensures that technology can interpret the structure and meaning of the equation.\n""p - Maintain Consistency: Use consistent formatting across all math content to help students recognize patterns.\n""h4 - Sensory Characteristics\n""p - For Visual Information: Don't use color alone. If you highlight something in red, also use bold text or an asterisk. For images, graphs, or complex diagrams, provide a text description or a data table.\n""p - For Audio Information: Always provide captions or a transcript for videos and podcasts. This ensures that someone who can't hear the audio can still get all the information.\n""p - For Interactions: Don't rely on spatial instructions like \"click the top-right button.\" Instead, use clear labels like \"Click the 'Submit' button.\" This allows users with motor or cognitive impairments to navigate easily.\n""h4 - Visual Content\n""p - Include Descriptive Text: Provide text descriptions of complex equations to aid understanding for users.\n""p - Textual Descriptions: Provide a brief description of the equation's significance or context to support understanding.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Accessible Encoding: Verify that equations and formulas are encoded with MathML or LaTeX, not as images, so screen readers can interpret them.\n""p - Descriptive Alternatives: Ensure all graphs, charts, and diagrams have a detailed text description or an accessible data table.\n""p - Structured Content: Confirm that content is organized with proper headings and lists for clear navigation.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Choosing Content\n""p - When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Uses MathML for formulas and equations\n""p - Well structured, using headings and lists\n""p - Keyboard operable\n""p - Has good alt text and long descriptions for diagrams\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Structure\n""h2 - The Principle\n""p - The structure of our content should provide a clear and logical framework that enhances a user's experience.\n""p - Headings and titles help organize the content logically and provide navigation points and are helpful for skimming content.\n""p - Tables effectively show relationships between data.\n""p - Lists simplify content and enhance readability by breaking content into manageable chunks.\n""p - Links and buttons are essential for connecting content to other content or actions. By using structural elements correctly, content is significantly improved for all users.\n""p - Here is an overview of each:\n""h3 - Headings\n""p - Headings apply to a wide range of formats such as slide titles, video chapters, spreadsheet names, subject lines, table captions or headings, page titles or metadata, and labels. Whatever the format, headings are used to label and organize content. They should convey structure and organization in a way that people and computers can recognize.\n""h4 - Best Practices\n""p - Use Formatting Tools - most text editors will have formatting tools that create headers. Using these tools not only makes it look like a header to the human eye but also tells the computer to mark it as a header. The computer can tell screen readers or other assistive technology what the content structure is. This will also create an outline of your document, when used correctly.\n""p - Use Precise Wording - Headings should be descriptive, concise, and consistent so users understand the structure easily.\n""p - Use Hierarchical Order - Heading levels should be used in a logical, hierarchical, and nested order. Best practice suggests there should be one heading level one for each piece of content (per page or per document).\n""p - Heading 1​\n""p - Heading 2​\n""p - Heading 3​\n""p - Heading 2​\n""p - Heading 3\n""p - Heading 1​\n""p - Heading 1​\n""p - Heading 3​\n""p - Heading 2​\n""p - Heading 4\n""h3 - Tables\n""h3 - Lists\n""h3 - Links and Buttons\n""p - All together these elements make up the structure of our digital content. Following this aspect will make it easier for assistive technology like screen readers and voice access to navigate digitally.\n""p - Continue to the next aspect to keep learning:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Tips for Writing Alternatives\n""h2 - Logos\n""p - Logo alt text should contain the name of the company, organization, or product. It should specify it is a logo and include any additional text in the logo.\n""p - To determine if your image is a logo or functions as a logo:\n""p - Does the image represent the identity of an organization, brand, or product?\n""p - Is the logo used to communicate ownership, affiliation, or authenticity?\n""p - Is the logo not functional (e.g., linking to a homepage)?\n""h2 - Functional\n""p - When an image serves a function (button, interactive element, link, etc.), the alt text should convey the function or action triggered. The alt text should follow the rules of the function and no longer be descriptive of the visual.\n""p - For example, an image of a printer with the alt text “Print this page”, or a logo that functions as a button with the alt text “BYU-Idaho home”.\n""p - To determine if your image is functional:\n""p - Does the image act as a link, button, or other interactive element?\n""p - Would any information or function be lost if the image were removed?\n""h2 - Images of Text\n""p - Images of text should be avoided. We recommend using CSS to style real text instead of using an image of text.\n""h2 - Complex\n""p - For images that are too complex to provide a complete alternative in the alt text, you will need a two-part alternative. First is the alternative text, which should be a summary of the image. Second is the detailed description, which will provide the full visual information of the image.\n""p - To determine if your image is complex:\n""p - Does the image contain data, relationships, or trends that need explanation or structure?\n""p - Does the image require interpretation of color, labels, or other structure?\n""p - If I write an alternative with all of the visual information in the image, will it be longer than a sentence or two (250 characters approximately)?\n""h3 - Example\n""p - Alt Text: Bar graph titled Days of Snow\n""p - Description: The X axis shows the number of days of snow ranging from 0 to 16, and the Y axis shows the months of December, January, February, and March. Data: December, 2; January, 6; February, 14; March, 3.\n""h2 - Groups\n""p - Groups of images part of a sequence or collage generally convey one overall theme or piece of information. Add the semantic alternative to the first image in the group or sequence and mark the rest as decorative.\n""p - Example: “Two out of five stars”.\n""p - To determine if your images are a group:\n""p - Do the images collectively convey one message or theme?\n""p - Are the images used to show a sequence, comparison, or collection?\n""h2 - Maps\n""p - The alt text for a map should summarize the purpose. Is it to show geography, directions, statistical data, or a specific location?\n""p - If the map contains significant detail, include long description that includes important locations, routes, markers, or areas.\n""h2 - Emotional Content\n""p - If an image conveys emotion or sets a tone, describe the emotions or atmosphere. Images that convey humor and irony need to have a detailed description without adding interpretation or assumptions.\n""p - To determine emotion and tone of your image:\n""p - Do I have an emotional response to the image?\n""p - What visual elements contribute to the mood or tone of the image?\n""p - What is the underlying message or story conveyed by the image?\n""p - Would the absence of the image reduce the emotional impact of the content?\n""h3 - Example\n""p - Meme. Top text: Makes memes accessible with alt text. Central image: child with fist clenched in pumping motion. Bottom: Righteous.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Understand Digital Accessibility\n""p - This page covers how we can build accessible thinking into our daily workflow and mindset. It includes a basic understand of what digital accessibility is and what principles to use. These are important for everyone to learn.\n""h2 - What is Digital Accessibility?\n""p - We define digital accessibility as “the practice of ensuring equally effective and equally integrated functionality, interaction with, and access to digital content for all otherwise qualified users with substantially equivalent ease of use.”\n""h3 - What it Means\n""p - Equally effective and equally integrated functionality means that people with disabilities should be able to use the same tools and features as everyone else, without being separated into a different or “lesser” experience.\n""p - Interaction with digital content refers to how users navigate, click, type, or otherwise engage with content. Digtal accessibility ensures these interactions are possible for people using assistive technologies like screen readers, voice control, or alternative input devices.\n""p - Access to digital content means that all users should be able to reach and understand the information provided in the same timeframe without barriers that exclude them.\n""p - For all otherwise qualified users emphasizes that digital accessibility is about removing unnecessary barriers; if someone has the skills or rights to use the content, disability should not be what prevents them from participating.\n""p - With substantially equivalent ease of use means the experience should be just as usable and efficient for people with disabilities as it is for everyone else, without extra steps, delays, or difficulties.\n""h2 - Why Digital Accessibility Matters\n""h3 - Our Mission\n""p - As part of the BYU-Idaho mission, we aim to provide a high-quality education to students of all abilities. Digital accessibility is an essential part of supporting a diverse student body. The Accessibility Services Office assists 5-10% of students. However, data from the National Center for Education Statistics (2019–20) shows that 20.5% of undergraduate students report having a disability. These statistics show a pressing need for accessible accommodations, both digital and physical.\n""p - This need aligns with our mission to:\n""p - “Provide a high-quality education that prepares students of diverse interests and abilities for lifelong learning and employment.” (1)\n""p - Providing accessible content is necessary to fulfill this mission and is part of our responsibility to care for those around us. Digital accessibility is an essential part of completing this and providing equal opportunity for students to grow academically, socially, and spiritually. We want to support every student on their journey to develop as a disciple of Jesus Christ.\n""h3 - Not All Individuals Disclose a Disability\n""h3 - Innovation\n""h3 - Digital Accessibility Improves Design\n""h2 - Color Block Activity\n""p - This activity illustrates some of the issues that people with disability may face. Follow along with the instructions in the video and ponder the questions below.\n""p - Reflect on the activity you just completed by answering these questions in the comment section:\n""p - Which version was easier, and which was harder? Why?\n""p - What connections can you draw between digital accessibility, disability, and this color block activity?\n""p - Here are some conclusions you may draw:\n""p - This activity illustrates how conflicting or distracting information can slow down response time. For individuals with disabilities, the input they receive may be partial or distorted, requiring extra effort to fill in the gaps before they can respond. This delay is simply a matter of processing speed and not a lack of intelligence or understanding. That is why it is necessary to provide fair accommodations for some students with disabilities. It levels the playing field by giving them the resources they need to demonstrate what they know.\n""h2 - Roles with Influence\n""p - Everyone can make a difference in their own sphere of influence and can contribute to digital accessibility. An individual may fulfill more than one listed role. These are not exhaustive but will hopefully give you an idea of where to get started.\n""h3 - Content Creators\n""p - Content creators are individuals or teams who produce or design digital materials in any format, whether for a course, a webpage, public distribution, or internal use. If you create materials for others or are publishing content, you play a key role in ensuring digital accessibility.\n""h3 - Instructors\n""p - Instructors are individuals or teams who provide or deliver educational experiences, whether in or out of the classroom. If your courses or learning materials rely on digital platforms, or if you are responsible for selecting materials that others will use for learning, then you play a key role in ensuring digital accessibility.\n""h3 - Developers\n""p - Developers are individuals or teams who create or maintain digital software, websites, content platforms, or applications. If you build, support, or update these tools, you play a key role in ensuring that the technology itself is accessible and usable for everyone.\n""h3 - Purchasers\n""p - Purchasers and administrators are individuals or teams who select, procure, or approve digital content and tools for use within an organization. If you participate in choosing, approving, or purchasing software, applications, or other digital resources, then you play a key role in ensuring digital accessibility is considered before adoption.\n""h2 - The POUR Principles\n""p - To ensure digital content is accessible, BYU-Idaho refers to the latest version of the Web Content Accessibility Guidelines (WCAG) at Level AA. These guidelines provide both required standards and other recommendations for designing accessible websites and digital materials.\n""p - WCAG is based on four principles, often referred to as POUR:\n""h3 - Perceivable\n""p - Content must be presented in ways users can perceive. In other words, people must be able to see, hear, or sense the content. This principle is aided by the use of assistive technology that tells a user about the digital content. It is also important that content is easy to notice.\n""p - For example, any visual or sensory content needs to have a text alternative so users with a vision impairment can still perceive what is trying to be conveyed. For more criteria visit the Perceivable section on the WCAG website:\n""h3 - Operable\n""p - Users must be able to interact with content, whether with a mouse, keyboard, or other tool of their choice. Assistive technology like voice access or eye tracking help with this principle. Watch out for content that is timed or asks for user input.\n""p - For example, all digital content needs to be navigable using just the keyboard. This allows users with mobility impairments to use keyboard alternatives when needed. For more criteria visit the Operable section on the WCAG website:\n""h3 - Understandable\n""p - Content must be clear and easy to understand. All content should have a consistent format and defined terms. Content should react as expected and if a mistake is made, there is help provided.\n""p - For example, a document or webpage needs to have consistent navigation and identification. This means that all links and buttons are labeled accordingly and are consistent across pages. This makes it easier for users with processing impairments to understand the content. For more criteria visit the Understandable section on the WCAG website:\n""h3 - Robust\n""p - Users may be using a variety of technology and software. This means content should be compatible with a wide array of tools and technologies. Content must work across different devices, browsers, and assistive technologies.\n""p - For example, the coded elements on a webpage need to be defined so that different browsers still read the elements the same way. This ensures that all users get the same experience. For more criteria visit the Robust section on the WCAG website:\n""h2 - The Aspects\n""p - The aspects are actionable steps based on the POUR principles. We use the aspects to train the campus on the basics of digital accessibility and the common issues users run into. To learn more about the aspects visit the Foundations tab:\n""h2 - Assistive Technology and POUR\n""p - Assistive technology (AT) includes the tools people use to interact with digital content in different ways, such as screen readers, screen magnifiers, voice input, switch devices, and captioning tools. These technologies bridge the gap between a person’s abilities and the digital environment, making content usable in multiple formats. When digital materials are designed with accessibility in mind, assistive technology can interpret and present information effectively.\n""p - The POUR principles—Perceivable, Operable, Understandable, and Robust—work hand in hand with assistive technology. For example, providing alt text and captions makes content perceivable by allowing screen readers and captioning software to convey information beyond sight and sound. Designing for keyboard use ensures that switch devices and voice commands can operate content smoothly. Clear structure and consistent navigation help users understand content regardless of how they access it. And building content to web standards makes it robust, ensuring it works reliably across different assistive technologies and platforms. Together, accessible design and assistive technology ensure that digital experiences are equally effective for everyone.\n""p - To learn more about assistive technology and what is available, visit our blog and see the article on assistive technology:\n""p - Accessibility Services\nOffice: 181 Manwaring Center\nHours:\nMonday - Friday 8:00 am - 5:00 pm\nClosed Tuesdays 11:20 am–12:20 pm for Devotional\nPhone: (208) 496-9210\nFax: (208) 496-9213\nEmail: accessibility@byui.edu\n""p - Important Links\n""p - Accommodations Login\n""p - Private Room Scheduling (Testing Center)\n""p - Report Accessibility Barrier\n""p - Request Accessibility Assistance\n""p - Book Accessibility Training\n""p - Connect\n""p - Engage Community\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Usability\n""h2 - The Principle\n""p - Usability checks we are meeting our organization’s definition of digital accessibility—ensuring content is effective, integrated, functional, and available. While the other aspects of digital accessibility focus on making content perceivable and operable by both humans and technology, usability is about bringing all those pieces together in practice. It bridges the gap between technical compliance and human experience, making sure that content is practical and intuitive to use.\n""h2 - How to Apply\n""h3 - Planning\n""p - Whether you are building or buying digital content, consider the accessibility concerns from the beginning and look for options and ideas that solve those concerns.\n""p - If you are creating content, it is helpful to use content checklists to make sure you cover all the possible accessibility points.\n""h3 - Testing\n""p - Incorporate basic accessibility tests throughout development and make sure content can be accessed through a variety of browsers, devices, operating systems, and settings. There are also built in digital accessibility checkers for a lot of content that will point out common issues.\n""p - For more information on testing visit our Evaluate for Accessibility page.\n""h3 - Feedback\n""p - Implement a way to get feedback from users and then incorporate the feedback when possible.\n""p - Users will have the most interaction with your content and will spot issues that you may miss. Be open to the feedback you receive.\n""p - Usability will ensure that every user can understand and navigate content, disability or not. It gives an equal ground for learning and fun for everyone.\n""p - Continue to the next aspect to keep learning:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Video\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with video based content.\n""p - Video is a popular and powerful media format that enables effective visual and auditory communication in a controlled environment. From entertainment to education, video can capture specific moments in time or act as the frame for edited content.\n""p - For this particular format, the term \"video\" refers to both video-only and multimedia (video/audio combination) content.\n""h3 - Frequently Asked Questions\n""h4 - When is video most useful?\n""p - Appropriate use cases include storytelling with visual and auditory information, longer content with more involved and complex concepts, and archiving presentations, classes, or lectures.\n""h4 - What are the benefits of video?\n""p - Benefits include multi-factor method of consuming visual and auditory content, can communicate a wide variety of different concepts in shorter timeframes, and includes some advantages of audio-focused content while removing contextual limitations.\n""h4 - What are the limitations of video?\n""p - Some limitations include far more involved and expensive than other methods, needs quality captions and an edited descriptive transcript to avoid excluding certain audiences, more difficult to share and send due to file sizes, and requires an accessible media player.\n""h3 - Recommended Software\n""h4 - Kaltura\n""p - A private, professional video management platform with a strong focus on accessibility and compliance for organizational use. It provides tools for creating and editing captions, offers robust keyboard navigation and screen reader support, and allows for the creation of audio descriptions.\n""h4 - YouTube\n""p - A public video-sharing platform that offers a broad range of accessibility features. This includes automatic and manually-added captions, transcripts, keyboard navigation, screen reader support, and the ability to adjust playback speed.\n""h2 - Create\n""p - Learn more about video creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Media player controls can be accessed and activated using various input types\n""p - Is the media player accessible?\n""p - Can the video be paused within 5 seconds, if it auto-plays?\n""p - Can all meaningful content be focused in a logical order?\n""h4 - Real Text\n""p - Clean verbatim descriptive transcript provided\n""p - Accurate, synchronized captions provided\n""p - Are speakers identified in both the captions and transcript?\n""p - Have the captions and transcript been edited for accuracy?\n""p - Is all on-screen text included in the captions or descriptive transcript?\n""h4 - Structure\n""p - Clear and logical progression, supported by a script\n""p - Chapter markers have been added to section the video\n""p - Provide context to tables verbally\n""p - Does the transcript use appropriate headings to mark chapters?\n""p - Does the transcript use appropriate structure elements?\n""p - Are links interactive with good descriptive text in the transcript?\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color\n""p - Media player controls meet contrast needs for all states\n""p - Are informational sounds included in the transcript?\n""p - Is color contrast sufficient between foreground and background of informational content?\n""h4 - Visual Content\n""p - Verbally describe all visuals\n""p - Visuals support narration or audio\n""p - Are flashes and flickers kept below 3 per second?\n""p - Does the transcript include a description of all visuals not described in the soundtrack?\n""h3 - Best Practices\n""h4 - Sound\n""p - Is the audio clear, without static or distortion?\n""p - Is the soundtrack optimized for mono playback?\n""p - Was a script used to plan the audio and video content?\n""h4 - Visuals\n""p - Do visuals support or provide context to the soundtrack?\n""p - Are flashes and flickers kept less than 3 per second?\n""p - Are visuals highly visible and not distracting?\n""p - Are speakers identified, either through the soundtrack, captions, or visuals on screen?\n""p - Are captions planned for in the placement of visuals?\n""h4 - Technical\n""p - Is the media player, including controls and other elements, accessible?\n""p - Has content been reviewed and/or created with the aspects in mind?\n""p - Did you run an accessibility checker and resolve all issues?\n""p - Do external and embedded resources meet accessibility requirements of the format?\n""p - Do all downloadable files include clear metadata?\n""p - If the video auto-plays, can it be stopped or paused within 5 seconds?\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Captions - Review that captions are available, accurate, and edited, not just automatically generated. Look at the first minute, random middle selection, and last minute of the video. Captions are quality when they are accurate, consistent, clear, readable, and equal.\n""p - Alternatives - Review for a descriptive transcript and audio description. Audio description (alongside the audio track) and the descriptive transcript (on its own) should provide an equivalent experience to watching the video. Additional audio description may not be needed if provided in the audio track.\n""p - Keyboard control - Use the Tab key on your keyboard to check that all video controls can be accessed without the mouse. Use Enter or Spacebar to activate a video control.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Choosing Content\n""p - Videos generally will not be accessible. Thus, they have to be paired with an accessible transcript and/or closed captions so that students will have an appropriate alternative. Automated captions frequently contain errors and may be more difficult to understand for many students, at least ensure that the captioning is correct and will not cause difficulties for those who require them. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Closed captions\n""p - Captions preferably not automatically generated and do not contain errors\n""p - An accessible transcript\n""p - The video player is also accessible and usable for users\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Video Conferencing\n""h2 - UNDERSTAND\n""p - Learn more about the content format and common accessibility issues before working with video conferencing.\n""p - Video conferencing tools have become more used through the years. They make it easier to collaborate and communicate in real time. We will focus on Zoom and Microsoft Teams, but many of the principles discussed here apply to other video conferencing platforms such as Google Meet, Cisco WebEx, Skype, and so on.\n""h3 - FREQUENTLY ASKED QUESTIONS\n""h4 - When is video conferencing the best format to use?\n""p - Appropriate use cases include meetings with users in different geographical locations.\n""h4 - What are the benefits of video conferencing?\n""p - On zoom, live transcription can be assigned to provide real-time captioning of the meeting\n""p - Screen reader and assistive technology compatible\n""p - User customizations (font size, keyboard shortcuts, etc.)\n""p - Auto-generated captions\n""p - Teams has noise suppression to limit background noise\n""h4 - What are the limitations of video conferencing?\n""p - Auto-generated captions are helpful but not sufficient to support all deaf and hard of hearing users\n""p - High bandwidth required for optimal performance\n""p - Limited customization of caption style and placement\n""p - Features are different on different devices and versions of the software.\n""p - Limitations on mobile devices\n""p - Hosts enable accessibility features\n""h3 - RECOMMENDED SOFTWARE\n""h4 - Zoom\n""p - A video conferencing platform known for its ease of use and high-quality audio and video. It supports a wide range of features, including screen sharing, chat, and breakout rooms, making it a popular choice for large meetings, webinars, and virtual classrooms.\n""h4 - Microsoft Teams\n""p - A collaboration platform that integrates video conferencing with chat, file storage, and app integration. It's part of the Microsoft 365 suite, designed to serve as a central hub for teamwork and communication within a business or educational setting.\n""h2 - CREATE\n""p - Learn more about video call principles. Applying the Aspects will address the most common accessibility issues and make the call more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - APPLY THE ASPECTS\n""h4 - USABILITY\n""p - Offer multiple methods to join (computer, phone, mobile, etc.)\n""p - Share accessible versions of displayed materials in advance\n""p - Are participants given an opportunity to share accessibility needs ahead of time?\n""p - Is the chosen platform compatible with a wide variety of assistive technology?\n""h4 - REAL TEXT\n""p - Post-meeting edited transcript and notes are provided to attendees\n""p - Provide interactive links, files, and announcements in the chat\n""p - Are fonts consistent, legible, and accessible to all audiences?\n""h4 - STRUCTURE\n""p - Prepare materials and plan flow in advance for smooth transitions\n""p - Are visual structure and relationships clear from spoken content?\n""p - Is the progression of information and agendas logical?\n""h4 - SENSORY CHARACTERISTICS\n""p - Highlight active speakers for easier navigation\n""p - Convey all information independent of color\n""p - Are non-speaking participants muted to reduce background noise?\n""p - Does speaker overlap minimized to ensure clear communication?\n""p - Are color choices complementary, of sufficient contrast, and easy to distinguish?\n""h4 - VISUAL CONTENT\n""p - Avoid flashing or rapidly changing content\n""p - Presenter video quality ensures their face is clear and easily visible.\n""p - Are visuals designed to maintain clarify across different devices and screen sizes?\n""p - Is the integration of shared visual aids seamless and effective?\n""h3 - BEST PRACTICES\n""h4 - PLATFORM\n""p - Is the platform accessible?\n""p - Does the platform work with a variety of assistive technology and various input methods?\n""p - Does the platform support closed captioning and sign language interpreters (always visible) appropriately?\n""p - Does the platform support a computer-based, mobile-based, and phone call-based audience?\n""h4 - PRESENTATION\n""p - Is there an assigned facilitator to lead the discussion and agenda?\n""p - Are participants encouraged to show a clear video of their face when speaking?\n""p - Is audio and video clear from all presenters and facilitators?\n""p - Is speaker overlap minimized?\n""p - Are non-speaking participants muted to minimize background noise?\n""h4 - TECHNICAL\n""p - Are connections, shared media, and backups tested in advance?\n""p - Are displayed and reference materials provided in advance to participants?\n""p - Do external, embedded, and referenced resources meet accessibility requirements of the format?\n""p - Are notes or recordings shared between participants for later reference and review?\n""h2 - EVALUATE\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h2 - DECIDE\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Remediation\n""p - After evaluating your content, you may find several accessibility issues. Prioritize remediating content that has the greatest impact on the user.\n""p - Once you've decided on the most critical accessibility issues to address, it's time to implement changes. This may involve:\n""p - Captions and Transcripts: Provide accurate captions for all video content and a full transcript for all audio.\n""p - Keyboard Navigation: Ensure all controls, such as mute and video on/off, are fully operable using only a keyboard.\n""p - Screen Reader Compatibility: All on-screen elements, including participant names and chat messages, must be correctly labeled for screen readers.\n""p - Chat and Recordings: Ensure the chat feature is accessible with good color contrast and that all recorded content is also made accessible.\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Visual Content\n""h2 - The Principle\n""p - Just like sensory characteristics, visual content needs to be paired with a computer-understandable alternative. These alternatives include features like:\n""p - alternative text (concise description)\n""p - long descriptions (detailed description)\n""p - audio descriptions (separate audio track describing visuals)\n""p - verbal descriptions (descriptions of visuals in main audio)\n""p - descriptive transcripts (audio and visuals as text)\n""p - Visual content includes a wide range of content, including images, graphics, charts, diagrams, maps, icons, emojis, videos, and animations. These elements can make content easier to understand. However, their meaning and interpretation is often influenced and shaped by the context, purpose, and audience perspective.\n""h2 - Image Best Practices\n""p - Images play a valuable role in digital content. They provide a second view of information. However, they can also present unique accessibility concerns and challenges. We will review key points and best practices for digital accessibility with including images in your content.\n""p - These principles can be applied to other visual content as well.\n""p - Informative vs Decorative - decorative images are present for decorative purposes only and do not add any informational value to the content. Informative images convey information to the user and require alternative text to convey that informational value to technology.\n""p - Alternative Text - alternative text (or alt text for short) is a brief visual description of an image. Every informative image is required to have alt text. Alt text should be the most basic version of what the visual shows and is limited to a sentence or two (approximately 250 characters or less).\n""p - Long Description - long descriptions are detailed descriptions of an image when it cannot adequately be contained in alt text. There are no limits on how long a long description can be. Instead of including a long description, consider adding the information in the surrounding text.\n""h2 - Video Best Practices\n""p - Visuals - informational visuals in a video need to have sufficient contrast (4.5:1 ratio). It is helpful to describe any visuals on screen as part of the script.\n""p - Chapters - chapters can be used to break the video into sections and provide easy navigation to specific points of the video.\n""p - Captions - a complete transcription of the soundtrack or audio track of the video should be recorded in the captions. This will include all relevant and informational sounds and dialogue.\n""p - Audio Description - audio description provides information about actions, characters, scene changes, on-screen text, and other visual content not able to be understood from the main audio track or soundtrack. If the audio provides adequate description of visuals, there may not be a need for an audio description. This may be provided in a format accessible to a screen reader, as a separate video, as a separate audio track file, or other options.\n""p - Descriptive Transcript - descriptive transcripts are a direct alternative of the video. They are not generally used alongside or with the video but are independently able to provide the same information and an equivalent experience as the video. Descriptive transcripts need to follow all rules for accessibility of their format. An example is the written transcripts for general conference talks along with the videos on the church's website.\n""h2 - Moving Images\n""p - Moving images and animations make content more engaging and fun to use. However, these will require additional considerations for digital accessibility. Moving images or animations may cause discomfort or health issues for some users. When thoughtfully implemented, moving images and animations can enhance understanding and engagement without causing distraction, discomfort, or distress.\n""p - Some examples include: GIFs, transitions, loading animations, UI animations, 3D models, scroll animations, simulations, and automatic carousels.\n""p - Controls - provide an option to reduce motion such as a stop button or speed adjustments.\n""p - Alternatives - add a caption or description just like you would with an image or video. It's also possible to provide a static alternative that doesn't move. Avoid using animations as the only way of sharing critical information\n""p - Flashing - avoid flashing or rapidly changing content (more than 3 flashes per second), provide a warning beforehand if this is the case.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Visual Content\n""p - description\n""p - best practices\n""p - apply the aspects\n""h2 - Tips for Writing Alternative Text\n""h2 - Logos\n""p - Logo alt text should contain the name of the company, organization, or product. It should specify it is a logo and include any additional text in the logo.\n""p - To determine if your image is a logo or functions as a logo:\n""p - Does the image represent the identity of an organization, brand, or product?\n""p - Is the logo used to communicate ownership, affiliation, or authenticity?\n""p - Is the logonotfunctional (e.g., linking to a homepage)?\n""h2 - Functional\n""p - When an image serves a function (button, interactive element, link, etc.), the alt text should convey the function or action triggered. The alt text should follow the rules of the function and no longer be descriptive of the visual.\n""p - For example, an image of a printer with the alt text “Print this page”, or a logo that functions as a button with the alt text “BYU-Idaho home”.\n""p - To determine if your image is functional:\n""p - Does the image act as a link, button, or other interactive element?\n""p - Would any information or function be lost if the image were removed?\n""h2 - Images of Text\n""p - Images of text should be avoided. We recommend using CSS to style real text instead of using an image of text.\n""h2 - Complex\n""p - For images that are too complex to provide a complete alternative in the alt text, you will need a two-part alternative. First is the alternative text, which should be a summary of the image. Second is the detailed description, which will provide the full visual information of the image.\n""p - To determine if your image is complex:\n""p - Does the image contain data, relationships, or trends that need explanation or structure?\n""p - Does the image require interpretation of color, labels, or other structure?\n""p - If I write an alternative with all of the visual information in the image, will it be longer than a sentence or two (250 characters approximately)?\n""h3 - Example\n""p - Alt Text: Bar graph titled Days of Snow\n""p - Description: The X axis shows the number of days of snow ranging from 0 to 16, and the Y axis shows the months of December, January, February, and March. Data: December, 2; January, 6; February, 14; March, 3.\n""h2 - Groups\n""p - Groups of images part of a sequence or collage generally convey one overall theme or piece of information. Add the semantic alternative to the first image in the group or sequence and mark the rest as decorative.\n""p - Example: “Two out of five stars”.\n""p - To determine if your images are a group:\n""p - Do the images collectively convey one message or theme?\n""p - Are the images used to show a sequence, comparison, or collection?\n""h2 - Maps\n""p - The alt text for a map should summarize the purpose. Is it to show geography, directions, statistical data, or a specific location?\n""p - If the map contains significant detail, include long description that includes important locations, routes, markers, or areas.\n""h2 - Emotional Content\n""p - If an image conveys emotion or sets a tone, describe the emotions or atmosphere. Images that convey humor and irony need to have a detailed description without adding interpretation or assumptions.\n""p - To determine emotion and tone of your image:\n""p - Do I have an emotional response to the image?\n""p - What visual elements contribute to the mood or tone of the image?\n""p - What is the underlying message or story conveyed by the image?\n""p - Would the absence of the image reduce the emotional impact of the content?\n""h3 - Example\n""p - Meme. Top text: Makes memes accessible with alt text. Central image: child with fist clenched in pumping motion. Bottom: Righteous.\n""p - infographics\n""p - checklist\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Website\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with website content.\n""p - There are a lot of difference pieces that go into creating good accessible web content. Understanding these pieces and how they fit together is crucial. Each pieces contributes differently to the overall accessibility and using them in combination appropriately can make a significant impact on your content accessibility.\n""p - HTML should be the foundation of web content, using semantic HTML. ARIA should be used with caution to fill accessibility gaps, particularly with custom controls. CSS should enhance the visual presentation. JavaScript should be used to add interactive experiences and communicate dynamic changes.\n""h3 - Frequently Asked Questions\n""h4 - When is a website the best format?\n""p - Website are often the best format for accessibility when the content is dynamic, interactive, or needs to be updated frequently.\n""h4 - What are the benefits of websites?\n""p - Their inherent adaptability to different devices and screen sizes, the ability for users to customize display settings like font size and color, and the capacity for dynamic, interactive content.\n""h4 - What are the limitations of websites?\n""p - Typically requires more technical knowledge and expertise. It also require an internet connection to access.\n""h2 - Create\n""p - Learn more about website creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Website is responsive to user customization (screen size, magnification, high-contrast, auto-fill, etc.)\n""p - Communicate and associate error and status messages (semantically and visually)\n""p - Organization is consistent and predictable\n""p - Can repeated content be skipped?\n""p - Can all content be accessed and interacted with various input types without traps?\n""p - Is focus predictable, visible, and logical?\n""h4 - Real Text\n""p - Make text selectable and accurate\n""p - Is thelangattribute defined in the<html>tag and when necessary?\n""p - Is text information selectable and accurate, not an image of text?\n""p - Are semantic elements used wherever possible?\n""h4 - Structure\n""p - Page title is descriptive and unique\n""p - Each element style is unique from other elements (visually and semantically)\n""p - One, and always one,<H1>element per page\n""p - Are structural elements (headings, tables, links, lists, buttons, etc.) used appropriately?\n""p - Are adjacent links grouped as a single link?\n""p - Do tables include a caption and header cells with appropriate scope and span?\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color\n""p - Dynamically size and space elements for customization\n""p - Are informational sensory characteristics paired with a semantic partner?\n""p - Is color contrast sufficient between text or user interface and background?\n""h4 - Visual Content\n""p - All images have an alt attribute\n""p - Descriptive images have a blank alt attribute\n""p - Do all meaningful visuals (videos, images, diagrams, etc.) have an appropriate semantic alternative (alt text, long description, descriptive transcript, etc.)?\n""p - Do functional visuals have a semantic alternative that conveys their function?\n""h3 - Best Practices\n""h4 - Design\n""p - Is design and layout consistent across pages?\n""p - Are sizing, spacing, and layout techniques used help with content flow and interactions?\n""p - Are interactive elements distinct from static content?\n""p - Does content flow and build naturally and logically?\n""h4 - Technical\n""p - Do external and embedded resources meet accessibility requirements of the format?\n""p - Has content been reviewed and/or created with the aspects in mind?\n""p - Has accessibility been tested using automated and/or manual methods and all found issues resolved?\n""p - Is navigation and help easy to find and use?\n""p - Can users report accessibility barriers or issues?\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Run an automated checker - Use automated tools to check for code-based accessibility problems. If there are any errors or alerts, this gives you a good idea of where to start fixing digital accessibility.\n""p - Review heading hierarchy - Use a tool to show you the page structure and/or heading outline. Look for empty headings, skipped levels, and organization that doesn't make sense.\n""p - Check focus - Use the Tab key to move through interactive elements. Pay attention to the order of elements, the visual indication of where it is, and that all elements are focused.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Selecting Accessible Content\n""p - Determining accessible web content can be more difficult. When deciding on what content to provide, try to ensure that it is appropriately accessible. Sites that are widely known and reputable will be more likely to contain accessible features. Sites that contain clear headings and have less visual effects are also more likely to be more accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Uses proper headings and semantic HTML\n""p - Is easily navigable without repetition\n""p - Alt text for images\n""p - Sufficient color contrast for text and images\n""p - Follows established website conventions (i.e. navbar, footer, title)\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - When to Use: Microsoft Word, HTML, or PDF?\n""p - Creating accessible content ensures that all audiences can fully engage with your materials. This guide will help you understand the accessibility benefits and limitations of three common content formats: Word, HTML, and PDF. Use this information to help you determine when it is appropriate to use each method for your needs.\n""p - We recommend using HTML webpages whenever possible, as they are generally the most accessible and adaptive. PDFs should only be used as a last resort when content is intended for print.\n""h2 - HTML\n""p - HTML is a highly compatible and responsive language, and when used with best practices, it's easy to update and instantly available to users on any device. While some knowledge of its structure is required, it's a flexible and adaptable tool for creating accessible, mobile-friendly web pages.\n""p - Best Uses - HTML is ideal for creating mobile-friendly web pages and for content that needs frequent updates.\n""p - Benefits - HTML is highly flexible and adaptable, supporting all accessibility standards. Using semantic HTML helps screen readers, and it's easy to adjust for readability and contrast. Simple and complex tables can also be made accessible with semantic elements.\n""p - Limitations - HTML may require additional support for advanced multimedia. Additionally, accessibility can be a challenge with nested structures or merged cells.\n""h2 - Microsoft Word\n""p - Microsoft Word is an easy-to-use and widely compatible tool for creating and distributing documents on both desktops and mobile devices. However, if documents aren't created with accessibility in mind from the start, remediation can be a tedious process.\n""p - Best Uses - Word is best used for creating drafts, text documents, and templates.\n""p - Benefits - It has an easy-to-use built-in accessibility checker. Documents can be structured with headings, lists, and tables, and the native tools allow for accessible, simple tables with clear headers, rows, and columns.\n""p - Limitations - Word is limited to its native accessibility features. Complex tables cannot be made fully accessible due to these limitations.\n""h2 - PDF\n""p - PDFs are difficult to edit for accessibility and lack responsive features, though they are compatible with most devices. Ensuring full accessibility is a complex process. They must be tagged correctly, as auto-generated tags are usually insufficient, and manual tagging is a long and laborious process.\n""p - Best Uses - PDFs are best used for creating printable final versions and downloadable forms.\n""p - Benefits - A key benefit of PDFs is that they retain a fixed layout for printed versions. The format isn't limited to its original formatting, as you can customize tags and reading order. If tagged correctly, a PDF can also support both simple and complex tables.\n""p - Limitations - PDFs are complex to make accessible due to their tagging requirements. They also lack responsive and interactive features. Furthermore, auto-tagged content is insufficient, and manually remediating tags is a lengthy process.\n""\n\n---End of Page---\n""---Beginning of Page---\n\n""title - Word Processing\n""h2 - Understand\n""p - Learn more about the content format and common digital accessibility issues before working with word processing documents.\n""p - Word processing documents are the most widely known and used form of digital content. Word processing documents are primarily text-based content, presented in a linear fashion. A few examples of word processing software (that produce word processing documents) are Google Docs, Microsoft Word, Pages, WordPerfect, and LibreOffice.\n""h3 - Frequently Asked Questions\n""h4 - When are word documents the best format choice?\n""p - A few key times when a word processing document might be the best option:\n""p - Regular editing and updating\n""p - Collaborative drafting, editing, or group content creation\n""p - Drafts or temporary versions\n""p - Internal business documents (familiar format)\n""p - Simple, text-based content\n""h4 - What are the benefits of Word documents?\n""p - Easy to make accessible, update, or change\n""p - User customization\n""p - Easy to skim, navigate, and digest\n""p - More future-proof with advances and changes in technology or operating systems\n""h4 - What are the limitations of Word documents?\n""p - Limited to the semantic options available in the word processing document\n""p - Limited control over complex content (tables, multi-column layouts, mixed media)\n""p - Non-linear content structure options are limited\n""p - Potentially requires a specific software to view or use the document\n""p - Lack of accessible support for forms\n""h3 - Recommended Software\n""h4 - Microsoft Word\n""p - This word processor allows users to create accessible documents by using built-in heading styles, creating alternative text for images and tables, and ensuring proper reading order. It also includes an Accessibility Checker to identify and fix common issues, which helps users meet accessibility standards.\n""h4 - Google Docs\n""p - Known for its real-time collaboration, Google Docs also provides accessibility features. It supports screen reader compatibility and keyboard navigation, and allows users to add alt text to images. The web-based nature and compatibility with assistive technologies make it accessible for many users.\n""h4 - LibreOffice\n""p - As a free, open-source word processor, LibreOffice Writer is a powerful tool for creating accessible documents. It offers features for tagging content, adding alt text to images, and exporting documents to accessible formats like tagged PDF, helping to ensure that content is readable by assistive technologies.\n""h2 - Create\n""p - Learn more about word processing document creation principles. Applying the Aspects will address the most common digital accessibility issues and make the content more accessible and user-friendly. Focus on the Best Practices after all the Aspects have been applied. They are “nice-to-haves” in accessibility but not as urgent.\n""h3 - Apply the Aspects\n""h4 - Usability\n""p - Repeat all important information from the header and footer.\n""p - Make all content part of the linear flow.\n""p - Verify headings in navigation pane (no blanks, skipped levels, etc.)\n""p - The user should be able to access all the content using only the arrow keys.\n""p - All content should receive focus on a logical order.\n""h4 - Real Text\n""p - Set the document language\n""p - Avoid text boxes, WordArt, SmartArt, and Drop Caps.\n""p - Insert Math and STEM content semantically.\n""p - Set the language for the document. If any other language is used in the document it should be set for that section of text.\n""p - Text should be selectable and accurate, not an image of text.\n""h4 - Structure\n""p - Use styles to apply formatting and structure consistently.\n""p - Give links descriptive visible text and a ScreenTip (when applicable).\n""p - Add appropriate structure through built-in tools and design.\n""p - Show structure visually as well as semantically.\n""p - The document should be free of all text boxes and other non-linear important content.\n""h4 - Sensory Characteristics\n""p - Convey all information independent of color.\n""p - Keep structure, flow, and design simple.\n""p - Use layout options to add white space.\n""p - Use paragraph layout and spacing options instead of multiple blank characters.\n""p - Color contrast should be sufficient between foreground and background for all informational content.\n""h4 - Visual Content\n""p - Anchor objects to the linear content.\n""p - Use built-in tools for stylistic design (borders, indentations, margins, sections, columns, etc.)\n""p - Informational images have alt text; decorative images are ignored.\n""p - The semantic alternative should be adjusted to not repeat context.\n""p - If there is a need for long description, it should be included either in the context or linked near the visual.\n""h3 - Best Practices\n""h4 - Content\n""p - Ensure that all informational content is in the linear flow of text, the language clear, simple, and direct, the content is organized in a logical and predictable manner, and all jargon, technical terms, and acronyms are defined or explained. The fonts, layout, and formatting should be consistent throughout the whole document.\n""h4 - Technical\n""p - Ensure that external and embedded resources meet accessibility requirements and that the file has a descriptive title.\n""h2 - Evaluate\n""p - Walk through a quick accessibility check for content that is already been created to evaluate its digital accessibility. For an in-depth evaluation download the content checklist to get a quantitative score.\n""h3 - Quick Accessibility Check\n""p - Run an automated checker - Use an automated to review color and contrast, media and illustrations, tables, structure, and access. If there are any issues, this gives you a good idea of where to start fixing for accessibility.\n""p - Review navigation pane - Turn on the outline viewer (navigation pane) to see anything that is marked with an outline level (headings). Look for blank lines, skipped levels (indented too far), and organization that doesn't make sense.\n""p - Show paragraph marks - Show paragraph marks or non-printing characters to see the structure of the document. Scroll through the document and look for 2 or more consecutive blank characters (spaces, tabs, paragraphs). Pay attention to page breaks and end of documents.\n""h2 - Decide\n""p - Learn more about what to do with evaluation data and how to pick which content is most accessible.\n""h3 - Finding Content\n""p - Word Processing Documents are easier when it comes to accessibility. Editors generally offer accessibility checkers and things such as headings can be easily seen in the table of contents are just by examining the text. When deciding on what content to provide, try to ensure that it is appropriately accessible. Here is a list of some things to focus on when providing accessible content:\n""p - Proper use of headings\n""p - Alt text\n""p - Table of contents\n""p - High contrast between text and background\n""p - For more help request accessibility assistance for your content or schedule a training with a specialist, in person or online. These trainings can be as quick as 15mins or as long as an hour. They will teach you more about creating accessible content and answer additional questions you may have.\n""p - Feel free to add your own tips and tricks into the comment section:\n""\n\n---End of Page---\n"