{"intents": [{"tag": "General Accessibility Awareness & Culture", "patterns": ["How can we create a culture of accessibility across all departments and functions at the university?", "What are the key benefits of making higher education accessible to all students?", "What future trends in digital accessibility should higher education institutions be aware of?", "How does accessibility benefit others without disabilities?", "How does accessibility help BYUI meet its goals?", "How does digital accessibility improve online learning for students?", "How would you explain the concept of \"accessible design\" to someone who thinks it's only important for people with disabilities? What argument could you make about how accessibility benefits everyone?", "What is digital accessibility, and why is it important?", "What is the difference between accessibility and digital accessibility?"]}, {"tag": "Laws, Policy, Compliance & Governance", "patterns": ["How do I know if I am violating accessibility laws or university policies when creating online content?", "What laws govern accessibility requirements for higher education institutions?", "Where can I find the university policy on digital accessibility?", "How can we develop an internal accessibility audit process to ensure ongoing compliance across departments?", "How often should we audit our course websites and materials for accessibility, and who is responsible for this?", "Does the Digital Accessibility Policy apply to social media?", "How do I determine whether my website conforms with the updated Digital Accessibility Policy?", "How do I report an accessibility issue?", "Is there an exception process to meeting the updated Policy requirements?", "Some of the Technical Guidelines appear to be too burdensome. What are my options?", "What are the consequences of not making our content accessible?", "What are the legal implications of neglecting accessibility?", "What is the technical standard for accessibility?"]}, {"tag": "WCAG-Specific Guidance", "patterns": ["How should accessibility considerations differ for public-facing vs. internal university content?", "Can you explain website accessibility standards in simple terms?", "Are there levels of accessibility?", "How do accessibility considerations vary across different cultures and languages?"]}, {"tag": "Assistive Technologies & Screen Readers", "patterns": ["How do we accommodate users with specific disabilities, such as visual, auditory, or neurodivergent conditions?", "How does AI and machine learning influence accessibility tools and resources?", "How can I ensure my materials are compatible with speech-to-text software and other assistive technologies?", "How do screen readers interact with headings?", "How does a screen reader work?", "Can you give me a basic rundown of what faculty need to know to make their content work well with screen readers?", "What information does a screen reader provide about a list?", "What types of assistive technologies support students in higher education?", "What steps would you take to investigate a report that a website is inaccessible for a visually impaired student using a screen reader and recommend as solutions?", "Some students use speech-to-text software. How can I ensure my materials are compatible with this technology?"]}, {"tag": "Design & UX for Accessibility", "patterns": ["Can you explain the difference between a \"keyboard-accessible\" design and one that isn't? Why is keyboard accessibility important?", "Do I have to \"dumb down\" my site in order to make it accessible?", "Do I have to sacrifice aesthetics of my website in order to make it accessible?", "Does this mean I need to create a text-only version of my site?", "How can I make my content accessible without compromising the overall design and user experience?", "How do I balance design with accessibility?", "How can haptic feedback in devices be designed to be accessible?", "How can physical sensory characteristics be considered and used?", "How do I ensure accessibility in interactive media like virtual reality (VR) or augmented reality (AR)?", "How do I make sure my online content works well across various devices, including mobile devices, tablets, and desktop computers?", "How do you balance accessibility with good design? Won't accessibility make our design clunky?", "What is the difference between \"accessibility\" and \"usability,\" and why is it important to consider both when designing digital content?"]}, {"tag": "Course & Instructional Content Accessibility", "patterns": ["What is Universal Design for Learning (UDL), and how does it relate to digital accessibility in the context of university courses?", "How do I know if I'm meeting accessibility standards for my online courses?", "How would you communicate the best practices for creating accessible content for a mixed-ability classroom to them in a way that's both easy to understand and actionable?", "How would you approach a conversation when a faculty member reaches out and says they are not sure how to make their online lectures accessible?", "Can you provide an example of how to create accessible content that is also universally designed to be inclusive of all learning styles?", "How can I make sure my course materials are accessible from the start, rather than having to retrofit accessibility later in the course design process?", "How can we support students with neurodivergent conditions through accessible content design?", "How do I make sure to include accessibility through content planning, design, and decision making?", "How does this affect student content?", "How does this impact instructors and course content?", "How does what I'm learning here connect to the accommodation letter I received?", "How can I effectively communicate the importance of changing the format of their course materials to be more accessible?", "I use a lot of PowerPoint presentations in my courses. How do I make sure they are accessible for all students?", "In my course, I use Google Docs and sometimes I share links to files in Google Drive. What do I need to know about making sure these are accessible to all students?", "Is access to accessible content an accommodation?", "None of my students submitted an accommodation request. Do I still need to make my course accessible?", "Some of my course material is in the form of podcasts. How do I ensure students with hearing impairments can still access the content?", "How is this different than accommodations provided by Accessibility Services?", "What can I do right now to increase the accessibility in my course?", "What role do faculty members play in creating an accessible learning environment?", "What is the difference between accessibility and accommodation?"]}, {"tag": "Documents (Word, PDF, PowerPoint, Excel)", "patterns": ["Are there tools or plugins that can help automate some aspects of PDF accessibility to make the process quicker and easier?", "How would you advise a department to make a scanned PDF more accessible?", "Can't Excel make accessible tables?", "What if I have a complex table in Word? How do I address that?"]}, {"tag": "Multimedia (Video, Audio, Captions, AD)", "patterns": ["How do I know if my captions meet the requirements?"]}, {"tag": "Alt Text", "patterns": ["How do I make sure that images, including decorative ones, are accessible to users with screen readers?", "How do you verify the quality of alt text, and what changes might need to be made to improve accessibility?", "Can you explain what alt text is and how to write good alt text for images or charts in my course materials?", "How do I write useful text equivalents for complex images, such as charts and graphs?", "How should alt text be written for different types of images, charts, and graphs?"]}, {"tag": "Assessments & Interactive Content", "patterns": ["What elements of an online form should a faculty member pay attention to?", "How can we make online quizzes and assessments accessible for all students, including those with disabilities?", "How do I ensure the accessibility of online event registration forms and systems?", "How do lists and form elements correlate and overlap (dropdowns, select, etc.)?", "What alternative formats or descriptions would you suggest to accommodate a student with a visual impairment needs to access an online quiz that uses complex images?", "What accessibility considerations should be made for online quizzes or exams to ensure they are inclusive?"]}, {"tag": "Tools, Testing, and Audits", "patterns": ["Are there any tools or checklists I can use to ensure compliance?", "How do I do manual testing?", "Why do I need both automated testing and manual testing?", "If a website fails an accessibility audit, what should be the first steps taken to begin remediation?", "Can't I just do manual testing then?", "What are the best practices for auditing a website or content for accessibility?", "What are the limitations of automated accessibility testing tools, and why is manual testing still essential?", "What tools are available to check digital accessibility?", "How do I evaluate my entire website for accessibility errors?", "How do we test usability for users with different disabilities?", "How do we track and measure improvements in accessibility over time?"]}, {"tag": "Complex Content (Math, Data Viz)", "patterns": ["Does math count as visual content? How do I make it accessible?", "How do I make equations and mathematical notation accessible?", "What alternatives can be used for presenting data when tables become too complex?", "What are key considerations for accessible charts and graphs?", "What are the best practices for creating accessible data visualizations, infographics, and charts?", "What formats can I have complex tables?"]}, {"tag": "Content Creation (Links, Lists, Tables)", "patterns": ["Are there times when a list specifically should be used?", "Can't users just skim to find what they need?", "Explain the difference between buttons and links again. How do I know when to use each one?", "How can buttons in navigation menus be made accessible?", "How can icon only buttons be made accessible?", "How can nested lists be made to be more accessible?", "How do merged and split cells affect table accessibility?", "What are best practices for creating an accessible toggle button?", "What are common mistakes with buttons and links?", "What are key characteristics of an accessible button?", "What are the differences between inline links, button-style links, and image links?", "What are the key elements of an accessible table, and how can I make complex tables accessible?", "What are the key elements of an accessible table?", "What attribute should be added to buttons to improve accessibility?", "What considerations are needed for making links, buttons, and navigation menus accessible?", "What happens if a button or link is missing a name or label?", "What happens when a link's destination is unclear or broken?", "What is a skip link?", "What is the importance of a table caption, and how should I structure complex tables for accessibility?", "What is the importance of a table caption?", "What is the role of links in menus?"]}, {"tag": "Faculty Support, Training & Change Management", "patterns": ["How would you prioritize addressing accessibility issues while meeting the timeline for a project?", "What key points would you discuss with IT about accessibility, and how would you ensure they understand the importance of meeting accessibility standards?", "How would you explain the importance of color contrast to a faculty member who is designing a course webpage, and what tools could they use to check for adequate contrast?", "How do I approach faculty or staff who are resistant to adopting accessibility standards for their online content?", "How can we gather student feedback on accessibility, and how do we use it to improve the design of course materials?", "How much time will it take me to make my materials accessible?", "How would you handle a situation where a department is resistant to adopting accessibility standards for their online content? What arguments or strategies could you use to help them understand the importance of accessibility?", "How can I explain the value of accessibility in a way that highlights its long-term benefits vs the time it will take to make content accessible now?", "Should I prioritize fixing issues that affect the largest number of people, or address each individual request as it comes?", "What are some strategies for encouraging faculty and staff to prioritize accessibility in their content creation?"]}, {"tag": "Exceptions, Edge-Cases & Special Scenarios", "patterns": ["Are there any exceptions to what needs to be accessible?", "Can my content get an exception?", "Do I need to make all my past digital content accessible, or just new content moving forward?", "Do I need to make my content accessible even if there is no one with a disability using my content?", "Does all this digital accessibility stuff apply to emails?", "Does this limit my academic freedom?", "How do we ensure accessibility in legacy content, and what challenges might arise when retrofitting older materials?", "How do we ensure accessibility in ongoing content updates or changes?", "I've made my content accessible, but how do I ensure it remains accessible when updates or changes are made?", "Must we make websites accessible if instead we can accommodate a person with a disability in a non-technical manner?", "What about content that is password protected?", "What about historical data? Do I need to update all my old content?", "What are the exceptions to needing something to be accessible?", "What do we do if accessibility issues arise that we weren't aware of during the initial course development?", "What if I can't make my content accessible?", "What if my target audience is small?"]}, {"tag": "Philosophy, Motivation & Value of Accessibility", "patterns": ["Can a product be usable but not accessible?", "How many disabilities are there?", "How many people are actually affected?", "Isn't it just for a small percentage of users? Is it really worth my time and effort?", "What challenges do students with disabilities face when accessibility is not prioritized?", "What impact does accessibility have on SEO (Search Engine Optimization) and user engagement?", "What is the key to making content accessible?"]}, {"tag": "Practical \"Where do I start?\" / Getting Help", "patterns": ["This is a lot of information, where do I start?", "What can I do now to get started?", "What are common accessibility mistakes?", "What are common accessibility violations and how can they be avoided?", "What are examples of digital content?", "What is the most accessible format?"]}, {"tag": "Technical Implementation & ARIA", "patterns": ["What are ARIA roles, and how can they be used to improve accessibility on websites for screen reader users?", "What is ARIA?", "What role do ARIA landmarks play in web accessibility?", "What role do ARIA roles play in web accessibility?", "What role does ARIA play in web accessibility?", "Can you explain the term 'programmatically determined'? Can you give examples?", "Can I use an accessibility plugin or overlay to make my website accessible?", "How can accessibility be integrated into continuous development and deployment pipelines?", "How do dynamic content impact accessibility, and how can we address these issues?", "What is semantic? Can you explain it more?"]}, {"tag": "Color & Visual Design", "patterns": ["How do I best use color and still maintain accessibility?", "How can I determine if text is real or an image?", "How can real text be styled to look visually identical to an image of text?", "How do I convert an image of text to real text? It would take too long to type", "How do I ensure that color is not the sole method of conveying important information on a website?", "What does 'color contrast' mean in terms of accessibility, and why is it so important for readability?", "What is appropriate color contrast?", "What is the best font to use for accessibility?", "What are common mistakes in using sensory characteristics to convey information?", "What are strategies to reduce sensory overload in content design?", "What are the guidelines for using animations and flashing elements to avoid sensory overload?", "What is the difference between sensory characteristics and sensory feedback?"]}, {"tag": "Headings & Structure", "patterns": ["Do headings really matter? Why are they so important?", "Can I visually hide a heading but still make it accessible?", "How long should headings be?", "Is too many headings a thing?", "Should headings be used in tables?", "What are common mistakes to avoided when creating headings?", "What are the risks of inconsistent or vague headings?", "What is the difference between a heading and regular text? (Isn't that only html or DOCX?)"]}, {"tag": "Third-Party & Vendor Content", "patterns": ["How do I handle accessibility issues that arise when using third-party tools or platforms?", "Will this impact the use of third-party tools and content?", "How can I ensure that accessibility is considered when contracting with an outside vendor?", "How do we know if third-party content is accessible?", "How do we handle CAPTCHA for accessibility concerns, and what are alternative methods?", "If a webpage uses a CAPTCHA for verification, what are some accessibility concerns, and how would you suggest resolving them?"]}]}